{smcl}
{txt}{sf}{ul off}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/shraddhaanand/Documents/Classes/Spring 2020/MIT 14.33/Homework/Data/State Stata files/Karnataka Log.txt
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}11 May 2020, 13:27:02
{txt}
{com}. //use "/Users/shraddhaanand/Documents/Classes/Spring 2020/MIT 14.33/Homework/Data/all_cleaned_labeled.dta" if s == "AP"
. use "/Users/shraddhaanand/Documents/Classes/Spring 2020/MIT 14.33/Homework/Data/States Data/kar_finalData.dta"
{txt}
{com}. 
. //deflating series
. replace private = private/0.402567739 if year == 1996
{txt}(4 real changes made)

{com}. replace private = private/0.428639117 if year == 1997
{txt}(4 real changes made)

{com}. replace private = private/0.462973829 if year == 1998
{txt}(4 real changes made)

{com}. replace private = private/0.477179697 if year == 1999
{txt}(4 real changes made)

{com}. replace private = private/0.494572754 if year == 2000
{txt}(4 real changes made)

{com}. replace private = private/0.510476315 if year == 2001
{txt}(4 real changes made)

{com}. replace private = private/0.529444001 if year == 2002
{txt}(4 real changes made)

{com}. replace private = private/0.549921826 if year == 2003
{txt}(4 real changes made)

{com}. replace private = private/0.581407123 if year == 2004
{txt}(4 real changes made)

{com}. replace private = private/0.614093269 if year == 2005
{txt}(4 real changes made)

{com}. replace private = private/0.665682865 if year == 2006
{txt}(4 real changes made)

{com}. replace private = private/0.711910667 if year == 2007
{txt}(4 real changes made)

{com}. replace private = private/0.777363518 if year == 2008
{txt}(4 real changes made)

{com}. replace private = private/0.83209275 if year == 2009
{txt}(4 real changes made)

{com}. replace private = private/0.91967909 if year == 2010
{txt}(4 real changes made)

{com}. replace private = private/1 if year == 2011
{txt}(0 real changes made)

{com}. replace private = private/1.079343862 if year == 2012
{txt}(4 real changes made)

{com}. replace private = private/1.146117514 if year == 2013
{txt}(4 real changes made)

{com}. replace private = private/1.184303363 if year == 2014
{txt}(4 real changes made)

{com}. replace private = private/1.211300602 if year == 2015
{txt}(4 real changes made)

{com}. replace private = private/1.249144388 if year == 2016
{txt}(4 real changes made)

{com}. replace private = private/1.297055381 if year == 2017
{txt}(4 real changes made)

{com}. replace private = private/1.350385224 if year == 2018
{txt}(4 real changes made)

{com}. 
. replace public = public/0.402567739 if year == 1996
{txt}(4 real changes made)

{com}. replace public = public/0.428639117 if year == 1997
{txt}(4 real changes made)

{com}. replace public = public/0.462973829 if year == 1998
{txt}(4 real changes made)

{com}. replace public = public/0.477179697 if year == 1999
{txt}(4 real changes made)

{com}. replace public = public/0.494572754 if year == 2000
{txt}(4 real changes made)

{com}. replace public = public/0.510476315 if year == 2001
{txt}(4 real changes made)

{com}. replace public = public/0.529444001 if year == 2002
{txt}(4 real changes made)

{com}. replace public = public/0.549921826 if year == 2003
{txt}(4 real changes made)

{com}. replace public = public/0.581407123 if year == 2004
{txt}(4 real changes made)

{com}. replace public = public/0.614093269 if year == 2005
{txt}(4 real changes made)

{com}. replace public = public/0.665682865 if year == 2006
{txt}(4 real changes made)

{com}. replace public = public/0.711910667 if year == 2007
{txt}(4 real changes made)

{com}. replace public = public/0.777363518 if year == 2008
{txt}(4 real changes made)

{com}. replace public = public/0.83209275 if year == 2009
{txt}(4 real changes made)

{com}. replace public = public/0.91967909 if year == 2010
{txt}(4 real changes made)

{com}. replace public = public/1 if year == 2011
{txt}(0 real changes made)

{com}. replace public = public/1.079343862 if year == 2012
{txt}(4 real changes made)

{com}. replace public = public/1.146117514 if year == 2013
{txt}(4 real changes made)

{com}. replace public = public/1.184303363 if year == 2014
{txt}(4 real changes made)

{com}. replace public = public/1.211300602 if year == 2015
{txt}(4 real changes made)

{com}. replace public = public/1.249144388 if year == 2016
{txt}(4 real changes made)

{com}. replace public = public/1.297055381 if year == 2017
{txt}(4 real changes made)

{com}. replace public = public/1.350385224 if year == 2018
{txt}(4 real changes made)

{com}. 
. 
. replace sdp = sdp/0.402567739 if year == 1996
{txt}(4 real changes made)

{com}. replace sdp = sdp/0.428639117 if year == 1997
{txt}(4 real changes made)

{com}. replace sdp = sdp/0.462973829 if year == 1998
{txt}(4 real changes made)

{com}. replace sdp = sdp/0.477179697 if year == 1999
{txt}(4 real changes made)

{com}. replace sdp = sdp/0.494572754 if year == 2000
{txt}(4 real changes made)

{com}. replace sdp = sdp/0.510476315 if year == 2001
{txt}(4 real changes made)

{com}. replace sdp = sdp/0.529444001 if year == 2002
{txt}(4 real changes made)

{com}. replace sdp = sdp/0.549921826 if year == 2003
{txt}(4 real changes made)

{com}. replace sdp = sdp/0.581407123 if year == 2004
{txt}(4 real changes made)

{com}. replace sdp = sdp/0.614093269 if year == 2005
{txt}(4 real changes made)

{com}. replace sdp = sdp/0.665682865 if year == 2006
{txt}(4 real changes made)

{com}. replace sdp = sdp/0.711910667 if year == 2007
{txt}(4 real changes made)

{com}. replace sdp = sdp/0.777363518 if year == 2008
{txt}(4 real changes made)

{com}. replace sdp = sdp/0.83209275 if year == 2009
{txt}(4 real changes made)

{com}. replace sdp = sdp/0.91967909 if year == 2010
{txt}(4 real changes made)

{com}. replace sdp = sdp/1 if year == 2011
{txt}(0 real changes made)

{com}. replace sdp = sdp/1.079343862 if year == 2012
{txt}(4 real changes made)

{com}. replace sdp = sdp/1.146117514 if year == 2013
{txt}(4 real changes made)

{com}. replace sdp = sdp/1.184303363 if year == 2014
{txt}(4 real changes made)

{com}. replace sdp = sdp/1.211300602 if year == 2015
{txt}(2 real changes made)

{com}. replace sdp = sdp/1.249144388 if year == 2016
{txt}(0 real changes made)

{com}. replace sdp = sdp/1.297055381 if year == 2017
{txt}(0 real changes made)

{com}. replace sdp = sdp/1.350385224 if year == 2018
{txt}(0 real changes made)

{com}. 
. 
. 
. //taking the log of the series to mitigate the outlying values
. gen logpublic = log(public)
{txt}
{com}. label var logpublic "log(public)"
{txt}
{com}. 
. gen logprivate = log(private)
{txt}
{com}. label var logprivate "log(private)"
{txt}
{com}. 
. gen logsdp = log(sdp)
{txt}(18 missing values generated)

{com}. 
. //creating graph of the series
. label var qdate "Time"
{txt}
{com}. tsset qdate
{res}{txt}{col 9}time variable:  {res}{col 25}qdate, 1996q1 to 2019q4
{txt}{col 17}delta:  {res}1 quarter
{txt}
{com}. //graph twoway tsline logpublic logprivate logsdp, title("Private, Public, and SDP Series")
. graph twoway tsline logpublic logprivate logsdp, title("Private investment, Public investment, and SDP: Karnataka")
{res}{txt}
{com}. cd "/Users/shraddhaanand/Documents/Classes/Spring 2020/MIT 14.33/Homework/Data/State Stata files"
{res}/Users/shraddhaanand/Documents/Classes/Spring 2020/MIT 14.33/Homework/Data/State Stata files
{txt}
{com}. 
. 
. //ANALYSIS
. 
. tsset qdate, quarterly
{res}{txt}{col 9}time variable:  {res}{col 25}qdate, 1996q1 to 2019q4
{txt}{col 17}delta:  {res}1 quarter
{txt}
{com}. varsoc logprivate logpublic logsdp

{txt}{col 4}Selection-order criteria
{col 4}Sample:  {res}1997q1 - 2015q2 {txt}{col 49}Number of obs {col 68}= {res}       74
{col 3}{text}{c TLC}{hline 4}{c TT}{hline 9}{hline 8}{hline 1}{hline 5}{hline 7}{hline 8}{hline 1}{hline 9}{hline 1}{hline 9}{hline 1}{hline 9}{hline 1}{hline 1}{c TRC}
{col 3}{text}{c |}lag{col 8}{c |}    LL  {col 18}   LR  {col 27}  df{col 32}   p  {col 39}   FPE {col 48}    AIC {col 58}   HQIC {col 68}   SBIC {col 79}{c |}
{res}{col 3}{text}{c LT}{hline 4}{c +}{hline 9}{hline 8}{hline 1}{hline 5}{hline 7}{hline 8}{hline 1}{hline 9}{hline 1}{hline 9}{hline 1}{hline 9}{hline 1}{hline 1}{c RT}
{col 3}{text}{c |}  0{col 8}{c |}{result}{space 1} 27.8568{col 18}{col 27}{col 32}{col 39} .000103{col 48}{space 1}-.671807{col 58}{space 1}-.634545{col 68}{space 1}-.578399{col 79}{text}{c |}
{res}{col 3}{text}{c |}  1{col 8}{c |}{result}{space 1} 201.603{col 18}{space 1} 347.49{col 26}*{col 27}   9{col 32} 0.000{col 39} 1.2e-06{col 47}*{col 48}{space 1}-5.12441{col 57}*{col 58}{space 1}-4.97537{col 67}*{col 68}{space 1}-4.75078{col 77}*{col 79}{text}{c |}
{res}{col 3}{text}{c |}  2{col 8}{c |}{result}{space 1} 206.285{col 18}{space 1} 9.3631{col 27}   9{col 32} 0.404{col 39} 1.3e-06{col 48}{space 1} -5.0077{col 58}{space 1}-4.74687{col 68}{space 1}-4.35384{col 79}{text}{c |}
{res}{col 3}{text}{c |}  3{col 8}{c |}{result}{space 1} 213.073{col 18}{space 1} 13.576{col 27}   9{col 32} 0.138{col 39} 1.4e-06{col 48}{space 1}-4.94791{col 58}{space 1} -4.5753{col 68}{space 1}-4.01383{col 79}{text}{c |}
{res}{col 3}{text}{c |}  4{col 8}{c |}{result}{space 1} 221.155{col 18}{space 1} 16.164{col 27}   9{col 32} 0.064{col 39} 1.5e-06{col 48}{space 1}-4.92311{col 58}{space 1} -4.4387{col 68}{space 1} -3.7088{col 79}{text}{c |}
{res}{col 3}{text}{c BLC}{hline 4}{c BT}{hline 9}{hline 8}{hline 1}{hline 5}{hline 7}{hline 8}{hline 1}{hline 9}{hline 1}{hline 9}{hline 1}{hline 9}{hline 1}{hline 1}{c BRC}
{res}{txt}{space 3}Endogenous:  logprivate logpublic logsdp
{space 3} Exogenous:  _cons

{com}. //lag = 1
. 
. //check for stationarity
. corrgram logprivate

{txt}{col 43}-1       0       1 -1       0       1
 LAG       AC       PAC      Q     Prob>Q  [Autocorrelation]  [Partial Autocor]
{hline 79}
1     {res}{col 9} 0.9603{col 18} 0.9603{col 27} 91.329{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1} {col 63}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1} 
{txt}2     {res}{col 9} 0.9310{col 18} 0.1507{col 27} 178.08{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1} {col 63}        {c LT}{hline 1}       
{txt}3     {res}{col 9} 0.9002{col 18}-0.0180{col 27} 260.07{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1} {col 63}        {c |}        
{txt}4     {res}{col 9} 0.8788{col 18} 0.1534{col 27} 339.03{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1} {col 63}        {c LT}{hline 1}       
{txt}5     {res}{col 9} 0.8418{col 18}-0.2298{col 27} 412.29{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}  {col 63}       {hline 1}{c RT}        
{txt}6     {res}{col 9} 0.8132{col 18} 0.1082{col 27} 481.42{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}  {col 63}        {c |}        
{txt}7     {res}{col 9} 0.7874{col 18} 0.1071{col 27} 546.96{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}  {col 63}        {c |}        
{txt}8     {res}{col 9} 0.7722{col 18} 0.0745{col 27}  610.7{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}  {col 63}        {c |}        
{txt}9     {res}{col 9} 0.7463{col 18} 0.0068{col 27} 670.93{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}   {col 63}        {c |}        
{txt}10    {res}{col 9} 0.7253{col 18}-0.0073{col 27} 728.48{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}   {col 63}        {c |}        
{txt}11    {res}{col 9} 0.7087{col 18} 0.1273{col 27} 784.08{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}   {col 63}        {c LT}{hline 1}       
{txt}12    {res}{col 9} 0.6890{col 18}-0.0690{col 27} 837.24{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}   {col 63}        {c |}        
{txt}13    {res}{col 9} 0.6528{col 18}-0.2442{col 27} 885.54{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}   {col 63}       {hline 1}{c RT}        
{txt}14    {res}{col 9} 0.6140{col 18}-0.1408{col 27} 928.79{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}    {col 63}       {hline 1}{c RT}        
{txt}15    {res}{col 9} 0.5696{col 18}-0.1591{col 27} 966.47{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}    {col 63}       {hline 1}{c RT}        
{txt}16    {res}{col 9} 0.5304{col 18} 0.0238{col 27} 999.55{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}    {col 63}        {c |}        
{txt}17    {res}{col 9} 0.4765{col 18}-0.2842{col 27} 1026.6{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}     {col 63}      {hline 1}{hline 1}{c RT}        
{txt}18    {res}{col 9} 0.4414{col 18} 0.3806{col 27} 1050.1{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}     {col 63}        {c LT}{hline 1}{hline 1}{hline 1}     
{txt}19    {res}{col 9} 0.4060{col 18}-0.1279{col 27} 1070.2{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}     {col 63}       {hline 1}{c RT}        
{txt}20    {res}{col 9} 0.3799{col 18} 0.0895{col 27} 1088.1{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}     {col 63}        {c |}        
{txt}21    {res}{col 9} 0.3419{col 18}-0.2872{col 27} 1102.8{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}      {col 63}      {hline 1}{hline 1}{c RT}        
{txt}22    {res}{col 9} 0.3162{col 18} 0.0359{col 27} 1115.5{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}      {col 63}        {c |}        
{txt}23    {res}{col 9} 0.2887{col 18}-0.1391{col 27} 1126.2{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}      {col 63}       {hline 1}{c RT}        
{txt}24    {res}{col 9} 0.2647{col 18} 0.0031{col 27} 1135.4{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}      {col 63}        {c |}        
{txt}25    {res}{col 9} 0.2239{col 18}-0.1482{col 27}   1142{col 36}0.0000{col 44}        {c LT}{hline 1}       {col 63}       {hline 1}{c RT}        
{txt}26    {res}{col 9} 0.1903{col 18} 0.1460{col 27} 1146.9{col 36}0.0000{col 44}        {c LT}{hline 1}       {col 63}        {c LT}{hline 1}       
{txt}27    {res}{col 9} 0.1559{col 18}-0.0012{col 27} 1150.2{col 36}0.0000{col 44}        {c LT}{hline 1}       {col 63}        {c |}        
{txt}28    {res}{col 9} 0.1153{col 18}-0.1720{col 27}   1152{col 36}0.0000{col 44}        {c |}        {col 63}       {hline 1}{c RT}        
{txt}29    {res}{col 9} 0.0660{col 18} 0.0069{col 27} 1152.6{col 36}0.0000{col 44}        {c |}        {col 63}        {c |}        
{txt}30    {res}{col 9} 0.0339{col 18} 0.1163{col 27} 1152.8{col 36}0.0000{col 44}        {c |}        {col 63}        {c |}        
{txt}31    {res}{col 9} 0.0044{col 18}-0.0879{col 27} 1152.8{col 36}0.0000{col 44}        {c |}        {col 63}        {c |}        
{txt}32    {res}{col 9}-0.0242{col 18}-0.0415{col 27} 1152.9{col 36}0.0000{col 44}        {c |}        {col 63}        {c |}        
{txt}33    {res}{col 9}-0.0615{col 18}-0.0332{col 27} 1153.5{col 36}0.0000{col 44}        {c |}        {col 63}        {c |}        
{txt}34    {res}{col 9}-0.0935{col 18}-0.2792{col 27} 1154.8{col 36}0.0000{col 44}        {c |}        {col 63}      {hline 1}{hline 1}{c RT}        
{txt}35    {res}{col 9}-0.1212{col 18}-0.0672{col 27}   1157{col 36}0.0000{col 44}        {c |}        {col 63}        {c |}        
{txt}36    {res}{col 9}-0.1435{col 18} 0.1024{col 27} 1160.3{col 36}0.0000{col 44}       {hline 1}{c RT}        {col 63}        {c |}        
{txt}37    {res}{col 9}-0.1797{col 18}-0.6801{col 27} 1165.4{col 36}0.0000{col 44}       {hline 1}{c RT}        {col 63}   {hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{c RT}        
{txt}38    {res}{col 9}-0.2066{col 18} 0.3080{col 27} 1172.3{col 36}0.0000{col 44}       {hline 1}{c RT}        {col 63}        {c LT}{hline 1}{hline 1}      
{txt}39    {res}{col 9}-0.2307{col 18}-0.3463{col 27} 1181.1{col 36}0.0000{col 44}       {hline 1}{c RT}        {col 63}      {hline 1}{hline 1}{c RT}        
{txt}40    {res}{col 9}-0.2509{col 18}-0.4579{col 27} 1191.7{col 36}0.0000{col 44}      {hline 1}{hline 1}{c RT}        {col 63}     {hline 1}{hline 1}{hline 1}{c RT}        
{txt}
{com}. //no
. corrgram logpublic

{txt}{col 43}-1       0       1 -1       0       1
 LAG       AC       PAC      Q     Prob>Q  [Autocorrelation]  [Partial Autocor]
{hline 79}
1     {res}{col 9} 0.9527{col 18} 0.9843{col 27} 89.886{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1} {col 63}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1} 
{txt}2     {res}{col 9} 0.9123{col 18} 0.0673{col 27} 173.19{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1} {col 63}        {c |}        
{txt}3     {res}{col 9} 0.8657{col 18}-0.1105{col 27}    249{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}  {col 63}        {c |}        
{txt}4     {res}{col 9} 0.8255{col 18} 0.2138{col 27} 318.69{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}  {col 63}        {c LT}{hline 1}       
{txt}5     {res}{col 9} 0.7852{col 18}-0.2544{col 27} 382.43{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}  {col 63}      {hline 1}{hline 1}{c RT}        
{txt}6     {res}{col 9} 0.7511{col 18} 0.0807{col 27} 441.39{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}  {col 63}        {c |}        
{txt}7     {res}{col 9} 0.7130{col 18} 0.0175{col 27} 495.14{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}   {col 63}        {c |}        
{txt}8     {res}{col 9} 0.6822{col 18} 0.1269{col 27} 544.89{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}   {col 63}        {c LT}{hline 1}       
{txt}9     {res}{col 9} 0.6463{col 18}-0.0185{col 27} 590.06{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}   {col 63}        {c |}        
{txt}10    {res}{col 9} 0.6190{col 18} 0.1208{col 27} 631.97{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}    {col 63}        {c |}        
{txt}11    {res}{col 9} 0.5903{col 18} 0.0148{col 27} 670.54{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}    {col 63}        {c |}        
{txt}12    {res}{col 9} 0.5689{col 18} 0.0668{col 27} 706.78{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}    {col 63}        {c |}        
{txt}13    {res}{col 9} 0.5378{col 18} 0.0440{col 27} 739.57{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}    {col 63}        {c |}        
{txt}14    {res}{col 9} 0.5108{col 18} 0.2131{col 27}  769.5{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}    {col 63}        {c LT}{hline 1}       
{txt}15    {res}{col 9} 0.4782{col 18} 0.0910{col 27} 796.06{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}     {col 63}        {c |}        
{txt}16    {res}{col 9} 0.4470{col 18}-0.0123{col 27} 819.56{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}     {col 63}        {c |}        
{txt}17    {res}{col 9} 0.4092{col 18}-0.0880{col 27}  839.5{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}     {col 63}        {c |}        
{txt}18    {res}{col 9} 0.3838{col 18} 0.3344{col 27} 857.27{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}     {col 63}        {c LT}{hline 1}{hline 1}      
{txt}19    {res}{col 9} 0.3621{col 18} 0.3233{col 27} 873.29{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}      {col 63}        {c LT}{hline 1}{hline 1}      
{txt}20    {res}{col 9} 0.3424{col 18}-0.0090{col 27}  887.8{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}      {col 63}        {c |}        
{txt}21    {res}{col 9} 0.3263{col 18} 0.1116{col 27} 901.16{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}      {col 63}        {c |}        
{txt}22    {res}{col 9} 0.3127{col 18}-0.2005{col 27} 913.59{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}      {col 63}       {hline 1}{c RT}        
{txt}23    {res}{col 9} 0.2957{col 18}-0.1380{col 27} 924.86{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}      {col 63}       {hline 1}{c RT}        
{txt}24    {res}{col 9} 0.2873{col 18} 0.2217{col 27} 935.65{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}      {col 63}        {c LT}{hline 1}       
{txt}25    {res}{col 9} 0.2693{col 18} 0.1825{col 27} 945.25{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}      {col 63}        {c LT}{hline 1}       
{txt}26    {res}{col 9} 0.2516{col 18} 0.0421{col 27} 953.76{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}      {col 63}        {c |}        
{txt}27    {res}{col 9} 0.2317{col 18} 0.2031{col 27} 961.08{col 36}0.0000{col 44}        {c LT}{hline 1}       {col 63}        {c LT}{hline 1}       
{txt}28    {res}{col 9} 0.2116{col 18} 0.0573{col 27} 967.27{col 36}0.0000{col 44}        {c LT}{hline 1}       {col 63}        {c |}        
{txt}29    {res}{col 9} 0.1846{col 18} 0.1374{col 27} 972.06{col 36}0.0000{col 44}        {c LT}{hline 1}       {col 63}        {c LT}{hline 1}       
{txt}30    {res}{col 9} 0.1587{col 18} 0.4674{col 27} 975.64{col 36}0.0000{col 44}        {c LT}{hline 1}       {col 63}        {c LT}{hline 1}{hline 1}{hline 1}     
{txt}31    {res}{col 9} 0.1336{col 18}-0.0598{col 27} 978.23{col 36}0.0000{col 44}        {c LT}{hline 1}       {col 63}        {c |}        
{txt}32    {res}{col 9} 0.1144{col 18}-0.0014{col 27} 980.15{col 36}0.0000{col 44}        {c |}        {col 63}        {c |}        
{txt}33    {res}{col 9} 0.0816{col 18}-0.0568{col 27} 981.15{col 36}0.0000{col 44}        {c |}        {col 63}        {c |}        
{txt}34    {res}{col 9} 0.0527{col 18}-0.1414{col 27} 981.57{col 36}0.0000{col 44}        {c |}        {col 63}       {hline 1}{c RT}        
{txt}35    {res}{col 9} 0.0177{col 18}-0.0918{col 27} 981.62{col 36}0.0000{col 44}        {c |}        {col 63}        {c |}        
{txt}36    {res}{col 9}-0.0180{col 18}-0.2318{col 27} 981.67{col 36}0.0000{col 44}        {c |}        {col 63}       {hline 1}{c RT}        
{txt}37    {res}{col 9}-0.0603{col 18} 0.1666{col 27} 982.25{col 36}0.0000{col 44}        {c |}        {col 63}        {c LT}{hline 1}       
{txt}38    {res}{col 9}-0.1049{col 18}-0.2376{col 27} 984.03{col 36}0.0000{col 44}        {c |}        {col 63}       {hline 1}{c RT}        
{txt}39    {res}{col 9}-0.1452{col 18}-0.0722{col 27} 987.51{col 36}0.0000{col 44}       {hline 1}{c RT}        {col 63}        {c |}        
{txt}40    {res}{col 9}-0.1717{col 18} 0.4069{col 27} 992.47{col 36}0.0000{col 44}       {hline 1}{c RT}        {col 63}        {c LT}{hline 1}{hline 1}{hline 1}     
{txt}
{com}. //no 
. corrgram logsdp

{txt}{col 43}-1       0       1 -1       0       1
 LAG       AC       PAC      Q     Prob>Q  [Autocorrelation]  [Partial Autocor]
{hline 79}
1     {res}{col 9} 0.8075{col 18} 0.8360{col 27} 52.845{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}  {col 63}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}  
{txt}2     {res}{col 9} 0.7609{col 18} 0.4253{col 27} 100.38{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}  {col 63}        {c LT}{hline 1}{hline 1}{hline 1}     
{txt}3     {res}{col 9} 0.7202{col 18} 0.3038{col 27} 143.54{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}   {col 63}        {c LT}{hline 1}{hline 1}      
{txt}4     {res}{col 9} 0.6880{col 18} 0.2872{col 27} 183.45{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}   {col 63}        {c LT}{hline 1}{hline 1}      
{txt}5     {res}{col 9} 0.6508{col 18} 0.2522{col 27} 219.66{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}   {col 63}        {c LT}{hline 1}{hline 1}      
{txt}6     {res}{col 9} 0.6745{col 18} 0.1074{col 27} 259.09{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}   {col 63}        {c |}        
{txt}7     {res}{col 9} 0.6460{col 18} 0.0815{col 27} 295.77{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}   {col 63}        {c |}        
{txt}8     {res}{col 9} 0.6208{col 18} 0.1134{col 27} 330.12{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}    {col 63}        {c |}        
{txt}9     {res}{col 9} 0.5829{col 18} 0.0021{col 27} 360.84{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}    {col 63}        {c |}        
{txt}10    {res}{col 9} 0.5365{col 18}-0.0463{col 27} 387.25{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}    {col 63}        {c |}        
{txt}11    {res}{col 9} 0.5116{col 18} 0.0045{col 27} 411.63{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}    {col 63}        {c |}        
{txt}12    {res}{col 9} 0.4906{col 18} 0.0007{col 27} 434.38{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}     {col 63}        {c |}        
{txt}13    {res}{col 9} 0.4620{col 18} 0.0103{col 27} 454.88{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}     {col 63}        {c |}        
{txt}14    {res}{col 9} 0.4230{col 18}-0.0060{col 27} 472.32{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}     {col 63}        {c |}        
{txt}15    {res}{col 9} 0.3981{col 18} 0.0110{col 27} 488.02{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}     {col 63}        {c |}        
{txt}16    {res}{col 9} 0.3767{col 18} 0.0069{col 27}  502.3{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}     {col 63}        {c |}        
{txt}17    {res}{col 9} 0.3412{col 18}-0.0285{col 27} 514.21{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}      {col 63}        {c |}        
{txt}18    {res}{col 9} 0.3016{col 18} 0.0036{col 27} 523.67{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}      {col 63}        {c |}        
{txt}19    {res}{col 9} 0.2751{col 18} 0.0021{col 27} 531.67{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}      {col 63}        {c |}        
{txt}20    {res}{col 9} 0.2527{col 18} 0.0039{col 27} 538.54{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}      {col 63}        {c |}        
{txt}21    {res}{col 9} 0.2278{col 18} 0.0194{col 27} 544.22{col 36}0.0000{col 44}        {c LT}{hline 1}       {col 63}        {c |}        
{txt}22    {res}{col 9} 0.1931{col 18} 0.0065{col 27} 548.38{col 36}0.0000{col 44}        {c LT}{hline 1}       {col 63}        {c |}        
{txt}23    {res}{col 9} 0.1666{col 18} 0.0068{col 27} 551.52{col 36}0.0000{col 44}        {c LT}{hline 1}       {col 63}        {c |}        
{txt}24    {res}{col 9} 0.1442{col 18} 0.0100{col 27} 553.93{col 36}0.0000{col 44}        {c LT}{hline 1}       {col 63}        {c |}        
{txt}25    {res}{col 9} 0.1128{col 18} 0.0109{col 27} 555.42{col 36}0.0000{col 44}        {c |}        {col 63}        {c |}        
{txt}26    {res}{col 9} 0.0712{col 18}-0.0087{col 27} 556.03{col 36}0.0000{col 44}        {c |}        {col 63}        {c |}        
{txt}27    {res}{col 9} 0.0397{col 18}-0.0265{col 27} 556.22{col 36}0.0000{col 44}        {c |}        {col 63}        {c |}        
{txt}28    {res}{col 9} 0.0142{col 18}-0.0220{col 27} 556.25{col 36}0.0000{col 44}        {c |}        {col 63}        {c |}        
{txt}29    {res}{col 9}-0.0000{col 18} 0.1063{col 27} 556.25{col 36}0.0000{col 44}        {c |}        {col 63}        {c |}        
{txt}30    {res}{col 9}-0.0414{col 18} 0.0164{col 27} 556.47{col 36}0.0000{col 44}        {c |}        {col 63}        {c |}        
{txt}31    {res}{col 9}-0.0747{col 18}-0.0114{col 27} 557.21{col 36}0.0000{col 44}        {c |}        {col 63}        {c |}        
{txt}32    {res}{col 9}-0.1020{col 18} 0.0157{col 27} 558.62{col 36}0.0000{col 44}        {c |}        {col 63}        {c |}        
{txt}33    {res}{col 9}-0.1234{col 18} 0.0615{col 27} 560.74{col 36}0.0000{col 44}        {c |}        {col 63}        {c |}        
{txt}34    {res}{col 9}-0.1624{col 18} 0.0608{col 27} 564.48{col 36}0.0000{col 44}       {hline 1}{c RT}        {col 63}        {c |}        
{txt}35    {res}{col 9}-0.1889{col 18}-0.0124{col 27} 569.65{col 36}0.0000{col 44}       {hline 1}{c RT}        {col 63}        {c |}        
{txt}36    {res}{col 9}-0.2066{col 18} 0.0368{col 27}    576{col 36}0.0000{col 44}       {hline 1}{c RT}        {col 63}        {c |}        
{txt}37    {res}{col 9}-0.2188{col 18}-0.0425{col 27} 583.28{col 36}0.0000{col 44}       {hline 1}{c RT}        {col 63}        {c |}        
{txt}
{com}. //no
. 
. corrgram d.logprivate

{txt}{col 43}-1       0       1 -1       0       1
 LAG       AC       PAC      Q     Prob>Q  [Autocorrelation]  [Partial Autocor]
{hline 79}
1     {res}{col 9}-0.1603{col 18}-0.1626{col 27} 2.5201{col 36}0.1124{col 44}       {hline 1}{c RT}        {col 63}       {hline 1}{c RT}        
{txt}2     {res}{col 9} 0.0373{col 18} 0.0094{col 27} 2.6579{col 36}0.2648{col 44}        {c |}        {col 63}        {c |}        
{txt}3     {res}{col 9}-0.1490{col 18}-0.1626{col 27} 4.8803{col 36}0.1808{col 44}       {hline 1}{c RT}        {col 63}       {hline 1}{c RT}        
{txt}4     {res}{col 9} 0.2360{col 18} 0.2236{col 27}  10.52{col 36}0.0325{col 44}        {c LT}{hline 1}       {col 63}        {c LT}{hline 1}       
{txt}5     {res}{col 9}-0.1658{col 18}-0.1201{col 27} 13.336{col 36}0.0204{col 44}       {hline 1}{c RT}        {col 63}        {c |}        
{txt}6     {res}{col 9}-0.0385{col 18}-0.1158{col 27} 13.489{col 36}0.0359{col 44}        {c |}        {col 63}        {c |}        
{txt}7     {res}{col 9}-0.1018{col 18}-0.0795{col 27} 14.574{col 36}0.0419{col 44}        {c |}        {col 63}        {c |}        
{txt}8     {res}{col 9} 0.0987{col 18}-0.0115{col 27} 15.606{col 36}0.0484{col 44}        {c |}        {col 63}        {c |}        
{txt}9     {res}{col 9}-0.0560{col 18} 0.0029{col 27} 15.943{col 36}0.0681{col 44}        {c |}        {col 63}        {c |}        
{txt}10    {res}{col 9}-0.0813{col 18}-0.1320{col 27}  16.66{col 36}0.0822{col 44}        {c |}        {col 63}       {hline 1}{c RT}        
{txt}11    {res}{col 9} 0.0406{col 18} 0.0671{col 27} 16.841{col 36}0.1127{col 44}        {c |}        {col 63}        {c |}        
{txt}12    {res}{col 9} 0.2374{col 18} 0.2393{col 27}   23.1{col 36}0.0269{col 44}        {c LT}{hline 1}       {col 63}        {c LT}{hline 1}       
{txt}13    {res}{col 9} 0.0430{col 18} 0.1271{col 27} 23.308{col 36}0.0381{col 44}        {c |}        {col 63}        {c LT}{hline 1}       
{txt}14    {res}{col 9} 0.0281{col 18} 0.1285{col 27} 23.398{col 36}0.0541{col 44}        {c |}        {col 63}        {c LT}{hline 1}       
{txt}15    {res}{col 9}-0.0715{col 18}-0.0627{col 27} 23.987{col 36}0.0653{col 44}        {c |}        {col 63}        {c |}        
{txt}16    {res}{col 9} 0.2110{col 18} 0.2401{col 27} 29.179{col 36}0.0228{col 44}        {c LT}{hline 1}       {col 63}        {c LT}{hline 1}       
{txt}17    {res}{col 9}-0.2901{col 18}-0.4289{col 27} 39.121{col 36}0.0017{col 44}      {hline 1}{hline 1}{c RT}        {col 63}     {hline 1}{hline 1}{hline 1}{c RT}        
{txt}18    {res}{col 9} 0.0517{col 18} 0.1020{col 27} 39.441{col 36}0.0025{col 44}        {c |}        {col 63}        {c |}        
{txt}19    {res}{col 9}-0.1074{col 18}-0.1191{col 27} 40.839{col 36}0.0025{col 44}        {c |}        {col 63}        {c |}        
{txt}20    {res}{col 9} 0.2154{col 18} 0.2554{col 27} 46.541{col 36}0.0007{col 44}        {c LT}{hline 1}       {col 63}        {c LT}{hline 1}{hline 1}      
{txt}21    {res}{col 9}-0.2068{col 18}-0.0812{col 27} 51.866{col 36}0.0002{col 44}       {hline 1}{c RT}        {col 63}        {c |}        
{txt}22    {res}{col 9} 0.0688{col 18} 0.0948{col 27} 52.464{col 36}0.0003{col 44}        {c |}        {col 63}        {c |}        
{txt}23    {res}{col 9}-0.0560{col 18}-0.0535{col 27} 52.865{col 36}0.0004{col 44}        {c |}        {col 63}        {c |}        
{txt}24    {res}{col 9} 0.1783{col 18} 0.0862{col 27}  56.99{col 36}0.0002{col 44}        {c LT}{hline 1}       {col 63}        {c |}        
{txt}25    {res}{col 9}-0.1682{col 18}-0.2192{col 27} 60.715{col 36}0.0001{col 44}       {hline 1}{c RT}        {col 63}       {hline 1}{c RT}        
{txt}26    {res}{col 9} 0.0180{col 18}-0.0591{col 27} 60.758{col 36}0.0001{col 44}        {c |}        {col 63}        {c |}        
{txt}27    {res}{col 9} 0.0751{col 18} 0.0976{col 27} 61.522{col 36}0.0002{col 44}        {c |}        {col 63}        {c |}        
{txt}28    {res}{col 9} 0.0579{col 18}-0.1058{col 27} 61.984{col 36}0.0002{col 44}        {c |}        {col 63}        {c |}        
{txt}29    {res}{col 9}-0.2059{col 18}-0.2075{col 27} 67.901{col 36}0.0001{col 44}       {hline 1}{c RT}        {col 63}       {hline 1}{c RT}        
{txt}30    {res}{col 9}-0.0180{col 18} 0.0002{col 27} 67.947{col 36}0.0001{col 44}        {c |}        {col 63}        {c |}        
{txt}31    {res}{col 9} 0.0121{col 18}-0.0418{col 27} 67.968{col 36}0.0001{col 44}        {c |}        {col 63}        {c |}        
{txt}32    {res}{col 9} 0.0882{col 18}-0.0783{col 27} 69.106{col 36}0.0002{col 44}        {c |}        {col 63}        {c |}        
{txt}33    {res}{col 9}-0.0787{col 18} 0.1504{col 27} 70.027{col 36}0.0002{col 44}        {c |}        {col 63}        {c LT}{hline 1}       
{txt}34    {res}{col 9} 0.0374{col 18}-0.0744{col 27} 70.238{col 36}0.0003{col 44}        {c |}        {col 63}        {c |}        
{txt}35    {res}{col 9}-0.0292{col 18}-0.2247{col 27} 70.368{col 36}0.0004{col 44}        {c |}        {col 63}       {hline 1}{c RT}        
{txt}36    {res}{col 9} 0.1477{col 18} 0.5136{col 27} 73.775{col 36}0.0002{col 44}        {c LT}{hline 1}       {col 63}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}    
{txt}37    {res}{col 9}-0.1274{col 18}-0.4996{col 27} 76.352{col 36}0.0002{col 44}       {hline 1}{c RT}        {col 63}     {hline 1}{hline 1}{hline 1}{c RT}        
{txt}38    {res}{col 9} 0.0033{col 18} 0.1812{col 27} 76.354{col 36}0.0002{col 44}        {c |}        {col 63}        {c LT}{hline 1}       
{txt}39    {res}{col 9} 0.0234{col 18} 0.2300{col 27} 76.444{col 36}0.0003{col 44}        {c |}        {col 63}        {c LT}{hline 1}       
{txt}40    {res}{col 9} 0.0573{col 18}-0.2075{col 27} 76.994{col 36}0.0004{col 44}        {c |}        {col 63}       {hline 1}{c RT}        
{txt}
{com}. //yes
. corrgram d.logpublic

{txt}{col 43}-1       0       1 -1       0       1
 LAG       AC       PAC      Q     Prob>Q  [Autocorrelation]  [Partial Autocor]
{hline 79}
1     {res}{col 9}-0.0721{col 18}-0.0723{col 27} .50925{col 36}0.4755{col 44}        {c |}        {col 63}        {c |}        
{txt}2     {res}{col 9} 0.1071{col 18} 0.1031{col 27} 1.6453{col 36}0.4393{col 44}        {c |}        {col 63}        {c |}        
{txt}3     {res}{col 9}-0.2269{col 18}-0.2169{col 27} 6.8017{col 36}0.0785{col 44}       {hline 1}{c RT}        {col 63}       {hline 1}{c RT}        
{txt}4     {res}{col 9} 0.2403{col 18} 0.2495{col 27} 12.647{col 36}0.0131{col 44}        {c LT}{hline 1}       {col 63}        {c LT}{hline 1}       
{txt}5     {res}{col 9}-0.1228{col 18}-0.0856{col 27} 14.192{col 36}0.0144{col 44}        {c |}        {col 63}        {c |}        
{txt}6     {res}{col 9} 0.0723{col 18}-0.0227{col 27} 14.734{col 36}0.0224{col 44}        {c |}        {col 63}        {c |}        
{txt}7     {res}{col 9}-0.2123{col 18}-0.1308{col 27} 19.452{col 36}0.0069{col 44}       {hline 1}{c RT}        {col 63}       {hline 1}{c RT}        
{txt}8     {res}{col 9} 0.0998{col 18} 0.0130{col 27} 20.506{col 36}0.0086{col 44}        {c |}        {col 63}        {c |}        
{txt}9     {res}{col 9}-0.1657{col 18}-0.1235{col 27} 23.449{col 36}0.0053{col 44}       {hline 1}{c RT}        {col 63}        {c |}        
{txt}10    {res}{col 9} 0.0691{col 18}-0.0158{col 27} 23.968{col 36}0.0077{col 44}        {c |}        {col 63}        {c |}        
{txt}11    {res}{col 9}-0.1592{col 18}-0.0677{col 27} 26.747{col 36}0.0050{col 44}       {hline 1}{c RT}        {col 63}        {c |}        
{txt}12    {res}{col 9} 0.0603{col 18}-0.0471{col 27} 27.151{col 36}0.0073{col 44}        {c |}        {col 63}        {c |}        
{txt}13    {res}{col 9}-0.2510{col 18}-0.2182{col 27} 34.233{col 36}0.0011{col 44}      {hline 1}{hline 1}{c RT}        {col 63}       {hline 1}{c RT}        
{txt}14    {res}{col 9} 0.0240{col 18}-0.0977{col 27} 34.298{col 36}0.0019{col 44}        {c |}        {col 63}        {c |}        
{txt}15    {res}{col 9}-0.0663{col 18} 0.0041{col 27} 34.804{col 36}0.0026{col 44}        {c |}        {col 63}        {c |}        
{txt}16    {res}{col 9} 0.1856{col 18} 0.0791{col 27}  38.82{col 36}0.0012{col 44}        {c LT}{hline 1}       {col 63}        {c |}        
{txt}17    {res}{col 9}-0.3081{col 18}-0.3406{col 27} 50.037{col 36}0.0000{col 44}      {hline 1}{hline 1}{c RT}        {col 63}      {hline 1}{hline 1}{c RT}        
{txt}18    {res}{col 9}-0.1028{col 18}-0.3253{col 27} 51.302{col 36}0.0000{col 44}        {c |}        {col 63}      {hline 1}{hline 1}{c RT}        
{txt}19    {res}{col 9}-0.0292{col 18} 0.0076{col 27} 51.405{col 36}0.0001{col 44}        {c |}        {col 63}        {c |}        
{txt}20    {res}{col 9} 0.1342{col 18}-0.1115{col 27}  53.62{col 36}0.0001{col 44}        {c LT}{hline 1}       {col 63}        {c |}        
{txt}21    {res}{col 9} 0.0622{col 18} 0.2006{col 27} 54.101{col 36}0.0001{col 44}        {c |}        {col 63}        {c LT}{hline 1}       
{txt}22    {res}{col 9} 0.0583{col 18} 0.1399{col 27} 54.529{col 36}0.0001{col 44}        {c |}        {col 63}        {c LT}{hline 1}       
{txt}23    {res}{col 9}-0.0913{col 18}-0.2188{col 27} 55.597{col 36}0.0002{col 44}        {c |}        {col 63}       {hline 1}{c RT}        
{txt}24    {res}{col 9} 0.0869{col 18}-0.1801{col 27} 56.578{col 36}0.0002{col 44}        {c |}        {col 63}       {hline 1}{c RT}        
{txt}25    {res}{col 9} 0.0495{col 18}-0.0394{col 27}   56.9{col 36}0.0003{col 44}        {c |}        {col 63}        {c |}        
{txt}26    {res}{col 9} 0.0349{col 18}-0.1991{col 27} 57.063{col 36}0.0004{col 44}        {c |}        {col 63}       {hline 1}{c RT}        
{txt}27    {res}{col 9}-0.0079{col 18}-0.0481{col 27} 57.071{col 36}0.0006{col 44}        {c |}        {col 63}        {c |}        
{txt}28    {res}{col 9}-0.0070{col 18}-0.1277{col 27} 57.078{col 36}0.0009{col 44}        {c |}        {col 63}       {hline 1}{c RT}        
{txt}29    {res}{col 9}-0.0698{col 18}-0.4607{col 27} 57.758{col 36}0.0012{col 44}        {c |}        {col 63}     {hline 1}{hline 1}{hline 1}{c RT}        
{txt}30    {res}{col 9} 0.1438{col 18} 0.0736{col 27} 60.692{col 36}0.0008{col 44}        {c LT}{hline 1}       {col 63}        {c |}        
{txt}31    {res}{col 9} 0.0035{col 18} 0.0109{col 27} 60.693{col 36}0.0011{col 44}        {c |}        {col 63}        {c |}        
{txt}32    {res}{col 9} 0.0901{col 18} 0.0662{col 27} 61.881{col 36}0.0012{col 44}        {c |}        {col 63}        {c |}        
{txt}33    {res}{col 9}-0.1134{col 18} 0.1582{col 27} 63.794{col 36}0.0010{col 44}        {c |}        {col 63}        {c LT}{hline 1}       
{txt}34    {res}{col 9} 0.1264{col 18} 0.1008{col 27} 66.206{col 36}0.0008{col 44}        {c LT}{hline 1}       {col 63}        {c |}        
{txt}35    {res}{col 9} 0.0991{col 18} 0.2349{col 27} 67.716{col 36}0.0007{col 44}        {c |}        {col 63}        {c LT}{hline 1}       
{txt}36    {res}{col 9} 0.0660{col 18}-0.2005{col 27} 68.396{col 36}0.0009{col 44}        {c |}        {col 63}       {hline 1}{c RT}        
{txt}37    {res}{col 9} 0.0299{col 18} 0.1904{col 27} 68.538{col 36}0.0012{col 44}        {c |}        {col 63}        {c LT}{hline 1}       
{txt}38    {res}{col 9}-0.0972{col 18}-0.0122{col 27} 70.066{col 36}0.0012{col 44}        {c |}        {col 63}        {c |}        
{txt}39    {res}{col 9}-0.1338{col 18}-0.4272{col 27} 73.013{col 36}0.0008{col 44}       {hline 1}{c RT}        {col 63}     {hline 1}{hline 1}{hline 1}{c RT}        
{txt}40    {res}{col 9} 0.0451{col 18}-0.0486{col 27} 73.354{col 36}0.0010{col 44}        {c |}        {col 63}        {c |}        
{txt}
{com}. //yes
. corrgram d.logsdp

{txt}{col 43}-1       0       1 -1       0       1
 LAG       AC       PAC      Q     Prob>Q  [Autocorrelation]  [Partial Autocor]
{hline 79}
1     {res}{col 9}-0.4754{col 18}-0.4754{col 27} 18.087{col 36}0.0000{col 44}     {hline 1}{hline 1}{hline 1}{c RT}        {col 63}     {hline 1}{hline 1}{hline 1}{c RT}        
{txt}2     {res}{col 9}-0.0289{col 18}-0.3298{col 27} 18.155{col 36}0.0001{col 44}        {c |}        {col 63}      {hline 1}{hline 1}{c RT}        
{txt}3     {res}{col 9}-0.0334{col 18}-0.3033{col 27} 18.247{col 36}0.0004{col 44}        {c |}        {col 63}      {hline 1}{hline 1}{c RT}        
{txt}4     {res}{col 9} 0.0198{col 18}-0.2626{col 27}  18.28{col 36}0.0011{col 44}        {c |}        {col 63}      {hline 1}{hline 1}{c RT}        
{txt}5     {res}{col 9} 0.0651{col 18}-0.1032{col 27} 18.638{col 36}0.0022{col 44}        {c |}        {col 63}        {c |}        
{txt}6     {res}{col 9}-0.0585{col 18}-0.0776{col 27} 18.931{col 36}0.0043{col 44}        {c |}        {col 63}        {c |}        
{txt}7     {res}{col 9}-0.0160{col 18}-0.1041{col 27} 18.953{col 36}0.0083{col 44}        {c |}        {col 63}        {c |}        
{txt}8     {res}{col 9} 0.0478{col 18} 0.0011{col 27} 19.155{col 36}0.0141{col 44}        {c |}        {col 63}        {c |}        
{txt}9     {res}{col 9} 0.0222{col 18} 0.0459{col 27} 19.199{col 36}0.0236{col 44}        {c |}        {col 63}        {c |}        
{txt}10    {res}{col 9}-0.0521{col 18}-0.0024{col 27} 19.446{col 36}0.0350{col 44}        {c |}        {col 63}        {c |}        
{txt}11    {res}{col 9}-0.0174{col 18} 0.0011{col 27} 19.474{col 36}0.0531{col 44}        {c |}        {col 63}        {c |}        
{txt}12    {res}{col 9} 0.0365{col 18}-0.0089{col 27} 19.599{col 36}0.0751{col 44}        {c |}        {col 63}        {c |}        
{txt}13    {res}{col 9} 0.0292{col 18} 0.0068{col 27}  19.68{col 36}0.1035{col 44}        {c |}        {col 63}        {c |}        
{txt}14    {res}{col 9}-0.0490{col 18}-0.0090{col 27} 19.912{col 36}0.1329{col 44}        {c |}        {col 63}        {c |}        
{txt}15    {res}{col 9}-0.0158{col 18}-0.0049{col 27} 19.937{col 36}0.1744{col 44}        {c |}        {col 63}        {c |}        
{txt}16    {res}{col 9} 0.0511{col 18} 0.0297{col 27} 20.197{col 36}0.2115{col 44}        {c |}        {col 63}        {c |}        
{txt}17    {res}{col 9} 0.0084{col 18}-0.0028{col 27} 20.205{col 36}0.2639{col 44}        {c |}        {col 63}        {c |}        
{txt}18    {res}{col 9}-0.0437{col 18}-0.0010{col 27} 20.402{col 36}0.3107{col 44}        {c |}        {col 63}        {c |}        
{txt}19    {res}{col 9}-0.0175{col 18}-0.0032{col 27} 20.434{col 36}0.3689{col 44}        {c |}        {col 63}        {c |}        
{txt}20    {res}{col 9} 0.0293{col 18}-0.0184{col 27} 20.525{col 36}0.4255{col 44}        {c |}        {col 63}        {c |}        
{txt}21    {res}{col 9} 0.0273{col 18}-0.0059{col 27} 20.606{col 36}0.4832{col 44}        {c |}        {col 63}        {c |}        
{txt}22    {res}{col 9}-0.0401{col 18}-0.0064{col 27} 20.784{col 36}0.5341{col 44}        {c |}        {col 63}        {c |}        
{txt}23    {res}{col 9}-0.0179{col 18}-0.0097{col 27}  20.82{col 36}0.5921{col 44}        {c |}        {col 63}        {c |}        
{txt}24    {res}{col 9} 0.0316{col 18}-0.0104{col 27} 20.935{col 36}0.6426{col 44}        {c |}        {col 63}        {c |}        
{txt}25    {res}{col 9} 0.0281{col 18} 0.0084{col 27} 21.027{col 36}0.6911{col 44}        {c |}        {col 63}        {c |}        
{txt}26    {res}{col 9}-0.0321{col 18} 0.0238{col 27}  21.15{col 36}0.7342{col 44}        {c |}        {col 63}        {c |}        
{txt}27    {res}{col 9}-0.0241{col 18} 0.0146{col 27} 21.221{col 36}0.7758{col 44}        {c |}        {col 63}        {c |}        
{txt}28    {res}{col 9}-0.0253{col 18}-0.1089{col 27} 21.301{col 36}0.8126{col 44}        {c |}        {col 63}        {c |}        
{txt}29    {res}{col 9} 0.0829{col 18}-0.0215{col 27} 22.171{col 36}0.8131{col 44}        {c |}        {col 63}        {c |}        
{txt}30    {res}{col 9}-0.0283{col 18} 0.0111{col 27} 22.274{col 36}0.8439{col 44}        {c |}        {col 63}        {c |}        
{txt}31    {res}{col 9}-0.0237{col 18}-0.0165{col 27} 22.348{col 36}0.8718{col 44}        {c |}        {col 63}        {c |}        
{txt}32    {res}{col 9}-0.0052{col 18}-0.0613{col 27} 22.352{col 36}0.8977{col 44}        {c |}        {col 63}        {c |}        
{txt}33    {res}{col 9} 0.0526{col 18}-0.0582{col 27} 22.734{col 36}0.9100{col 44}        {c |}        {col 63}        {c |}        
{txt}34    {res}{col 9}-0.0120{col 18} 0.0159{col 27} 22.754{col 36}0.9290{col 44}        {c |}        {col 63}        {c |}        
{txt}35    {res}{col 9}-0.0318{col 18}-0.0377{col 27} 22.901{col 36}0.9424{col 44}        {c |}        {col 63}        {c |}        
{txt}36    {res}{col 9}-0.0067{col 18} 0.0535{col 27} 22.908{col 36}0.9556{col 44}        {c |}        {col 63}        {c |}        
{txt}
{com}. //yes
. 
. varsoc logprivate logpublic logsdp

{txt}{col 4}Selection-order criteria
{col 4}Sample:  {res}1997q1 - 2015q2 {txt}{col 49}Number of obs {col 68}= {res}       74
{col 3}{text}{c TLC}{hline 4}{c TT}{hline 9}{hline 8}{hline 1}{hline 5}{hline 7}{hline 8}{hline 1}{hline 9}{hline 1}{hline 9}{hline 1}{hline 9}{hline 1}{hline 1}{c TRC}
{col 3}{text}{c |}lag{col 8}{c |}    LL  {col 18}   LR  {col 27}  df{col 32}   p  {col 39}   FPE {col 48}    AIC {col 58}   HQIC {col 68}   SBIC {col 79}{c |}
{res}{col 3}{text}{c LT}{hline 4}{c +}{hline 9}{hline 8}{hline 1}{hline 5}{hline 7}{hline 8}{hline 1}{hline 9}{hline 1}{hline 9}{hline 1}{hline 9}{hline 1}{hline 1}{c RT}
{col 3}{text}{c |}  0{col 8}{c |}{result}{space 1} 27.8568{col 18}{col 27}{col 32}{col 39} .000103{col 48}{space 1}-.671807{col 58}{space 1}-.634545{col 68}{space 1}-.578399{col 79}{text}{c |}
{res}{col 3}{text}{c |}  1{col 8}{c |}{result}{space 1} 201.603{col 18}{space 1} 347.49{col 26}*{col 27}   9{col 32} 0.000{col 39} 1.2e-06{col 47}*{col 48}{space 1}-5.12441{col 57}*{col 58}{space 1}-4.97537{col 67}*{col 68}{space 1}-4.75078{col 77}*{col 79}{text}{c |}
{res}{col 3}{text}{c |}  2{col 8}{c |}{result}{space 1} 206.285{col 18}{space 1} 9.3631{col 27}   9{col 32} 0.404{col 39} 1.3e-06{col 48}{space 1} -5.0077{col 58}{space 1}-4.74687{col 68}{space 1}-4.35384{col 79}{text}{c |}
{res}{col 3}{text}{c |}  3{col 8}{c |}{result}{space 1} 213.073{col 18}{space 1} 13.576{col 27}   9{col 32} 0.138{col 39} 1.4e-06{col 48}{space 1}-4.94791{col 58}{space 1} -4.5753{col 68}{space 1}-4.01383{col 79}{text}{c |}
{res}{col 3}{text}{c |}  4{col 8}{c |}{result}{space 1} 221.155{col 18}{space 1} 16.164{col 27}   9{col 32} 0.064{col 39} 1.5e-06{col 48}{space 1}-4.92311{col 58}{space 1} -4.4387{col 68}{space 1} -3.7088{col 79}{text}{c |}
{res}{col 3}{text}{c BLC}{hline 4}{c BT}{hline 9}{hline 8}{hline 1}{hline 5}{hline 7}{hline 8}{hline 1}{hline 9}{hline 1}{hline 9}{hline 1}{hline 9}{hline 1}{hline 1}{c BRC}
{res}{txt}{space 3}Endogenous:  logprivate logpublic logsdp
{space 3} Exogenous:  _cons

{com}. 
. //johansen test for cointegration
. vecrank logprivate logpublic logsdp, trend(trend) lags(4)
{res}
{txt}{center 79:Johansen tests for cointegration}
Trend: trend{col 57}Number of obs = {res}{col 6}     74
{txt}Sample:  {res}1997q1 - 2015q2{txt}{col 66}Lags = {res}      4
{txt}{hline 79}
{col 58}5%
maximum{col 46}trace{col 55}critical
  rank{col 11}parms{col 23}LL{col 32}eigenvalue{col 44}statistic{col 57}value
{col 3}{res}  0{col 12}33  {col 19} 202.29089{col 33}       .{col 44}  49.8570{col 55}  34.55
{col 3}  1{col 12}38  {col 19}  219.5635{col 33} 0.37301{col 44}  15.3118{help vecrankstar##|_new:*}{col 55}  18.17
{col 3}  2{col 12}41  {col 19} 224.26024{col 33} 0.11921{col 44}   5.9184{col 55}   3.74
{col 3}  3{col 12}42  {col 19} 227.21941{col 33} 0.07686
{txt}{hline 79}

{com}. //rank = 1 --> I(1) series so need to do VAR
. 
. vec logprivate logpublic logsdp, trend(trend) lags(4)

{res}{txt}Vector error-correction model

{col 1}Sample:  {res}1997q1 - 2015q2 {txt}{col 49}Number of obs{col 67}= {res}        74
{txt}{col 49}AIC{col 67}=  {res}-4.907122
{txt}Log likelihood = {res} 219.5635{txt}{col 49}HQIC{col 67}=  {res}-4.435141
{txt}Det(Sigma_ml){col 16}= {res} 5.31e-07{txt}{col 49}SBIC{col 67}=  {res}-3.723953

{col 1}{text}Equation        {col 18}  Parms{col 26}     RMSE {col 37}   R-sq  {col 47}   chi2   {col 58} P>chi2
{res}{col 1}{text}{hline 17}{hline 8}{hline 11}{hline 10}{hline 11}{hline 7}
{col 1}{text}D_logprivate    {col 18}{result}    12{col 26}{space 2}   .0939{col 37}{space 1} 0.1886{col 47} 14.41277{col 58} 0.2751
{col 1}{text}D_logpublic     {col 18}{result}    12{col 26}{space 2} .064249{col 37}{space 1} 0.1908{col 47} 14.61989{col 58} 0.2629
{col 1}{text}D_logsdp        {col 18}{result}    12{col 26}{space 2} .172022{col 37}{space 1} 0.5822{col 47} 86.39036{col 58} 0.0000
{col 1}{text}{hline 17}{hline 8}{hline 11}{hline 10}{hline 11}{hline 7}
{res}
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}D_logprivate {txt}{c |}
{space 8}_ce1 {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} -.104191{col 26}{space 2} .0611401{col 37}{space 1}   -1.70{col 46}{space 3}0.088{col 54}{space 4}-.2240235{col 67}{space 3} .0156414
{txt}{space 12} {c |}
{space 2}logprivate {c |}
{space 9}LD. {c |}{col 14}{res}{space 2}-.0741635{col 26}{space 2} .1385607{col 37}{space 1}   -0.54{col 46}{space 3}0.592{col 54}{space 4}-.3457374{col 67}{space 3} .1974104
{txt}{space 8}L2D. {c |}{col 14}{res}{space 2}-.1288311{col 26}{space 2}  .133101{col 37}{space 1}   -0.97{col 46}{space 3}0.333{col 54}{space 4}-.3897043{col 67}{space 3} .1320421
{txt}{space 8}L3D. {c |}{col 14}{res}{space 2}-.0350563{col 26}{space 2} .1298232{col 37}{space 1}   -0.27{col 46}{space 3}0.787{col 54}{space 4}-.2895051{col 67}{space 3} .2193925
{txt}{space 12} {c |}
{space 3}logpublic {c |}
{space 9}LD. {c |}{col 14}{res}{space 2}-.1779815{col 26}{space 2} .1906904{col 37}{space 1}   -0.93{col 46}{space 3}0.351{col 54}{space 4}-.5517278{col 67}{space 3} .1957648
{txt}{space 8}L2D. {c |}{col 14}{res}{space 2}-.0156555{col 26}{space 2} .1936915{col 37}{space 1}   -0.08{col 46}{space 3}0.936{col 54}{space 4} -.395284{col 67}{space 3} .3639729
{txt}{space 8}L3D. {c |}{col 14}{res}{space 2}-.1873986{col 26}{space 2} .1933914{col 37}{space 1}   -0.97{col 46}{space 3}0.333{col 54}{space 4}-.5664389{col 67}{space 3} .1916416
{txt}{space 12} {c |}
{space 6}logsdp {c |}
{space 9}LD. {c |}{col 14}{res}{space 2}-.2104943{col 26}{space 2} .1167974{col 37}{space 1}   -1.80{col 46}{space 3}0.072{col 54}{space 4} -.439413{col 67}{space 3} .0184243
{txt}{space 8}L2D. {c |}{col 14}{res}{space 2}-.1213978{col 26}{space 2} .0931092{col 37}{space 1}   -1.30{col 46}{space 3}0.192{col 54}{space 4}-.3038885{col 67}{space 3} .0610929
{txt}{space 8}L3D. {c |}{col 14}{res}{space 2}-.1019162{col 26}{space 2} .0653807{col 37}{space 1}   -1.56{col 46}{space 3}0.119{col 54}{space 4}-.2300601{col 67}{space 3} .0262276
{txt}{space 12} {c |}
{space 6}_trend {c |}{col 14}{res}{space 2} .0003319{col 26}{space 2} .0005163{col 37}{space 1}    0.64{col 46}{space 3}0.520{col 54}{space 4}-.0006801{col 67}{space 3} .0013438
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .0200189{col 26}{space 2} .0228849{col 37}{space 1}    0.87{col 46}{space 3}0.382{col 54}{space 4}-.0248347{col 67}{space 3} .0648725
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}D_logpublic  {txt}{c |}
{space 8}_ce1 {c |}
{space 9}L1. {c |}{col 14}{res}{space 2}-.0455619{col 26}{space 2} .0418339{col 37}{space 1}   -1.09{col 46}{space 3}0.276{col 54}{space 4}-.1275548{col 67}{space 3} .0364309
{txt}{space 12} {c |}
{space 2}logprivate {c |}
{space 9}LD. {c |}{col 14}{res}{space 2} .0295571{col 26}{space 2} .0948073{col 37}{space 1}    0.31{col 46}{space 3}0.755{col 54}{space 4}-.1562619{col 67}{space 3}  .215376
{txt}{space 8}L2D. {c |}{col 14}{res}{space 2}-.0365754{col 26}{space 2} .0910717{col 37}{space 1}   -0.40{col 46}{space 3}0.688{col 54}{space 4}-.2150725{col 67}{space 3} .1419218
{txt}{space 8}L3D. {c |}{col 14}{res}{space 2}-.0549142{col 26}{space 2} .0888289{col 37}{space 1}   -0.62{col 46}{space 3}0.536{col 54}{space 4}-.2290156{col 67}{space 3} .1191872
{txt}{space 12} {c |}
{space 3}logpublic {c |}
{space 9}LD. {c |}{col 14}{res}{space 2}-.0151891{col 26}{space 2}  .130476{col 37}{space 1}   -0.12{col 46}{space 3}0.907{col 54}{space 4}-.2709174{col 67}{space 3} .2405393
{txt}{space 8}L2D. {c |}{col 14}{res}{space 2} .2340767{col 26}{space 2} .1325295{col 37}{space 1}    1.77{col 46}{space 3}0.077{col 54}{space 4}-.0256763{col 67}{space 3} .4938298
{txt}{space 8}L3D. {c |}{col 14}{res}{space 2}-.1658036{col 26}{space 2} .1323242{col 37}{space 1}   -1.25{col 46}{space 3}0.210{col 54}{space 4}-.4251542{col 67}{space 3}  .093547
{txt}{space 12} {c |}
{space 6}logsdp {c |}
{space 9}LD. {c |}{col 14}{res}{space 2}-.1120029{col 26}{space 2} .0799162{col 37}{space 1}   -1.40{col 46}{space 3}0.161{col 54}{space 4}-.2686358{col 67}{space 3}   .04463
{txt}{space 8}L2D. {c |}{col 14}{res}{space 2}-.1210374{col 26}{space 2} .0637081{col 37}{space 1}   -1.90{col 46}{space 3}0.057{col 54}{space 4}-.2459029{col 67}{space 3} .0038282
{txt}{space 8}L3D. {c |}{col 14}{res}{space 2}-.1042549{col 26}{space 2} .0447354{col 37}{space 1}   -2.33{col 46}{space 3}0.020{col 54}{space 4}-.1919347{col 67}{space 3} -.016575
{txt}{space 12} {c |}
{space 6}_trend {c |}{col 14}{res}{space 2} .0001557{col 26}{space 2} .0003533{col 37}{space 1}    0.44{col 46}{space 3}0.659{col 54}{space 4}-.0005367{col 67}{space 3} .0008481
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .0110657{col 26}{space 2} .0156585{col 37}{space 1}    0.71{col 46}{space 3}0.480{col 54}{space 4}-.0196245{col 67}{space 3} .0417559
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}D_logsdp     {txt}{c |}
{space 8}_ce1 {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .6013385{col 26}{space 2}  .112007{col 37}{space 1}    5.37{col 46}{space 3}0.000{col 54}{space 4} .3818088{col 67}{space 3} .8208681
{txt}{space 12} {c |}
{space 2}logprivate {c |}
{space 9}LD. {c |}{col 14}{res}{space 2}-.3241569{col 26}{space 2} .2538393{col 37}{space 1}   -1.28{col 46}{space 3}0.202{col 54}{space 4}-.8216728{col 67}{space 3}  .173359
{txt}{space 8}L2D. {c |}{col 14}{res}{space 2}-.3621888{col 26}{space 2} .2438374{col 37}{space 1}   -1.49{col 46}{space 3}0.137{col 54}{space 4}-.8401012{col 67}{space 3} .1157237
{txt}{space 8}L3D. {c |}{col 14}{res}{space 2}-.2680961{col 26}{space 2} .2378325{col 37}{space 1}   -1.13{col 46}{space 3}0.260{col 54}{space 4}-.7342392{col 67}{space 3}  .198047
{txt}{space 12} {c |}
{space 3}logpublic {c |}
{space 9}LD. {c |}{col 14}{res}{space 2}-.0700265{col 26}{space 2} .3493395{col 37}{space 1}   -0.20{col 46}{space 3}0.841{col 54}{space 4}-.7547194{col 67}{space 3} .6146664
{txt}{space 8}L2D. {c |}{col 14}{res}{space 2}-.3908324{col 26}{space 2} .3548375{col 37}{space 1}   -1.10{col 46}{space 3}0.271{col 54}{space 4}-1.086301{col 67}{space 3} .3046364
{txt}{space 8}L3D. {c |}{col 14}{res}{space 2}  -.35347{col 26}{space 2} .3542878{col 37}{space 1}   -1.00{col 46}{space 3}0.318{col 54}{space 4}-1.047861{col 67}{space 3} .3409213
{txt}{space 12} {c |}
{space 6}logsdp {c |}
{space 9}LD. {c |}{col 14}{res}{space 2} .2790525{col 26}{space 2} .2139695{col 37}{space 1}    1.30{col 46}{space 3}0.192{col 54}{space 4}-.1403201{col 67}{space 3}  .698425
{txt}{space 8}L2D. {c |}{col 14}{res}{space 2} .1687387{col 26}{space 2} .1705735{col 37}{space 1}    0.99{col 46}{space 3}0.323{col 54}{space 4}-.1655792{col 67}{space 3} .5030566
{txt}{space 8}L3D. {c |}{col 14}{res}{space 2} .0491037{col 26}{space 2} .1197757{col 37}{space 1}    0.41{col 46}{space 3}0.682{col 54}{space 4}-.1856523{col 67}{space 3} .2838597
{txt}{space 12} {c |}
{space 6}_trend {c |}{col 14}{res}{space 2} .0000693{col 26}{space 2} .0009459{col 37}{space 1}    0.07{col 46}{space 3}0.942{col 54}{space 4}-.0017846{col 67}{space 3} .0019232
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .0160496{col 26}{space 2} .0419245{col 37}{space 1}    0.38{col 46}{space 3}0.702{col 54}{space 4} -.066121{col 67}{space 3} .0982202
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

Cointegrating equations
{res}
{col 1}{text}Equation        {col 18}  Parms{col 26}   chi2   {col 37} P>chi2
{res}{col 1}{text}{hline 17}{hline 8}{hline 11}{hline 7}
{col 1}{text}_ce1            {col 18}{result}     2{col 26} 38.46032{col 37} 0.0000
{col 1}{text}{hline 17}{hline 8}{hline 11}{hline 7}
{res}
{txt}Identification:  beta is exactly identified

{col 18}Johansen normalization restriction imposed
{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        beta{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}_ce1         {txt}{c |}
{space 2}logprivate {c |}{col 14}{res}{space 2}        1{col 26}{space 2}        .{col 37}{space 1}       .{col 46}{space 3}    .{col 54}{space 4}        .{col 67}{space 3}        .
{txt}{space 3}logpublic {c |}{col 14}{res}{space 2} .2620245{col 26}{space 2} .2724772{col 37}{space 1}    0.96{col 46}{space 3}0.336{col 54}{space 4} -.272021{col 67}{space 3}   .79607
{txt}{space 6}logsdp {c |}{col 14}{res}{space 2}  -2.3417{col 26}{space 2} .3793587{col 37}{space 1}   -6.17{col 46}{space 3}0.000{col 54}{space 4}-3.085229{col 67}{space 3}-1.598171
{txt}{space 6}_trend {c |}{col 14}{res}{space 2} .0188532{col 26}{space 2}        .{col 37}{space 1}       .{col 46}{space 3}    .{col 54}{space 4}        .{col 67}{space 3}        .
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 11.80239{col 26}{space 2}        .{col 37}{space 1}       .{col 46}{space 3}    .{col 54}{space 4}        .{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
. irf create var1, step(20) set(myirf) replace
{txt}(file myirf.irf now active)
(file myirf.irf updated)

{com}. irf graph oirf, impulse(logpublic logprivate) response(logprivate logpublic) yline(0,lcolor(black)) xlabel(0(4)20) byopts(yrescale)
{res}{txt}
{com}. 
. log close 
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/shraddhaanand/Documents/Classes/Spring 2020/MIT 14.33/Homework/Data/State Stata files/Karnataka Log.txt
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}11 May 2020, 13:27:09
{txt}{.-}
{smcl}
{txt}{sf}{ul off}