{smcl}
{txt}{sf}{ul off}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/shraddhaanand/Documents/Classes/Spring 2020/MIT 14.33/Homework/Data/State Stata files/Rajasthan Log.txt
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}11 May 2020, 13:42:25
{txt}
{com}. //use "/Users/shraddhaanand/Documents/Classes/Spring 2020/MIT 14.33/Homework/Data/all_cleaned_labeled.dta" if s == "AP"
. use "/Users/shraddhaanand/Documents/Classes/Spring 2020/MIT 14.33/Homework/Data/States Data/raj_finalData.dta"
{txt}
{com}. 
. //deflating series
. replace private = private/0.402567739 if year == 1996
{txt}(4 real changes made)

{com}. replace private = private/0.428639117 if year == 1997
{txt}(4 real changes made)

{com}. replace private = private/0.462973829 if year == 1998
{txt}(4 real changes made)

{com}. replace private = private/0.477179697 if year == 1999
{txt}(4 real changes made)

{com}. replace private = private/0.494572754 if year == 2000
{txt}(4 real changes made)

{com}. replace private = private/0.510476315 if year == 2001
{txt}(4 real changes made)

{com}. replace private = private/0.529444001 if year == 2002
{txt}(4 real changes made)

{com}. replace private = private/0.549921826 if year == 2003
{txt}(4 real changes made)

{com}. replace private = private/0.581407123 if year == 2004
{txt}(4 real changes made)

{com}. replace private = private/0.614093269 if year == 2005
{txt}(4 real changes made)

{com}. replace private = private/0.665682865 if year == 2006
{txt}(4 real changes made)

{com}. replace private = private/0.711910667 if year == 2007
{txt}(4 real changes made)

{com}. replace private = private/0.777363518 if year == 2008
{txt}(4 real changes made)

{com}. replace private = private/0.83209275 if year == 2009
{txt}(4 real changes made)

{com}. replace private = private/0.91967909 if year == 2010
{txt}(4 real changes made)

{com}. replace private = private/1 if year == 2011
{txt}(0 real changes made)

{com}. replace private = private/1.079343862 if year == 2012
{txt}(4 real changes made)

{com}. replace private = private/1.146117514 if year == 2013
{txt}(4 real changes made)

{com}. replace private = private/1.184303363 if year == 2014
{txt}(4 real changes made)

{com}. replace private = private/1.211300602 if year == 2015
{txt}(4 real changes made)

{com}. replace private = private/1.249144388 if year == 2016
{txt}(4 real changes made)

{com}. replace private = private/1.297055381 if year == 2017
{txt}(4 real changes made)

{com}. replace private = private/1.350385224 if year == 2018
{txt}(4 real changes made)

{com}. 
. replace public = public/0.402567739 if year == 1996
{txt}(4 real changes made)

{com}. replace public = public/0.428639117 if year == 1997
{txt}(4 real changes made)

{com}. replace public = public/0.462973829 if year == 1998
{txt}(4 real changes made)

{com}. replace public = public/0.477179697 if year == 1999
{txt}(4 real changes made)

{com}. replace public = public/0.494572754 if year == 2000
{txt}(4 real changes made)

{com}. replace public = public/0.510476315 if year == 2001
{txt}(4 real changes made)

{com}. replace public = public/0.529444001 if year == 2002
{txt}(4 real changes made)

{com}. replace public = public/0.549921826 if year == 2003
{txt}(4 real changes made)

{com}. replace public = public/0.581407123 if year == 2004
{txt}(4 real changes made)

{com}. replace public = public/0.614093269 if year == 2005
{txt}(4 real changes made)

{com}. replace public = public/0.665682865 if year == 2006
{txt}(4 real changes made)

{com}. replace public = public/0.711910667 if year == 2007
{txt}(4 real changes made)

{com}. replace public = public/0.777363518 if year == 2008
{txt}(4 real changes made)

{com}. replace public = public/0.83209275 if year == 2009
{txt}(4 real changes made)

{com}. replace public = public/0.91967909 if year == 2010
{txt}(4 real changes made)

{com}. replace public = public/1 if year == 2011
{txt}(0 real changes made)

{com}. replace public = public/1.079343862 if year == 2012
{txt}(4 real changes made)

{com}. replace public = public/1.146117514 if year == 2013
{txt}(4 real changes made)

{com}. replace public = public/1.184303363 if year == 2014
{txt}(4 real changes made)

{com}. replace public = public/1.211300602 if year == 2015
{txt}(4 real changes made)

{com}. replace public = public/1.249144388 if year == 2016
{txt}(4 real changes made)

{com}. replace public = public/1.297055381 if year == 2017
{txt}(4 real changes made)

{com}. replace public = public/1.350385224 if year == 2018
{txt}(4 real changes made)

{com}. 
. 
. replace sdp = sdp/0.402567739 if year == 1996
{txt}(4 real changes made)

{com}. replace sdp = sdp/0.428639117 if year == 1997
{txt}(4 real changes made)

{com}. replace sdp = sdp/0.462973829 if year == 1998
{txt}(4 real changes made)

{com}. replace sdp = sdp/0.477179697 if year == 1999
{txt}(4 real changes made)

{com}. replace sdp = sdp/0.494572754 if year == 2000
{txt}(4 real changes made)

{com}. replace sdp = sdp/0.510476315 if year == 2001
{txt}(4 real changes made)

{com}. replace sdp = sdp/0.529444001 if year == 2002
{txt}(4 real changes made)

{com}. replace sdp = sdp/0.549921826 if year == 2003
{txt}(4 real changes made)

{com}. replace sdp = sdp/0.581407123 if year == 2004
{txt}(4 real changes made)

{com}. replace sdp = sdp/0.614093269 if year == 2005
{txt}(4 real changes made)

{com}. replace sdp = sdp/0.665682865 if year == 2006
{txt}(4 real changes made)

{com}. replace sdp = sdp/0.711910667 if year == 2007
{txt}(4 real changes made)

{com}. replace sdp = sdp/0.777363518 if year == 2008
{txt}(4 real changes made)

{com}. replace sdp = sdp/0.83209275 if year == 2009
{txt}(4 real changes made)

{com}. replace sdp = sdp/0.91967909 if year == 2010
{txt}(4 real changes made)

{com}. replace sdp = sdp/1 if year == 2011
{txt}(0 real changes made)

{com}. replace sdp = sdp/1.079343862 if year == 2012
{txt}(4 real changes made)

{com}. replace sdp = sdp/1.146117514 if year == 2013
{txt}(4 real changes made)

{com}. replace sdp = sdp/1.184303363 if year == 2014
{txt}(4 real changes made)

{com}. replace sdp = sdp/1.211300602 if year == 2015
{txt}(2 real changes made)

{com}. replace sdp = sdp/1.249144388 if year == 2016
{txt}(0 real changes made)

{com}. replace sdp = sdp/1.297055381 if year == 2017
{txt}(0 real changes made)

{com}. replace sdp = sdp/1.350385224 if year == 2018
{txt}(0 real changes made)

{com}. 
. 
. 
. //taking the log of the series to mitigate the outlying values
. gen logpublic = log(public)
{txt}
{com}. label var logpublic "log(public)"
{txt}
{com}. 
. gen logprivate = log(private)
{txt}
{com}. label var logprivate "log(private)"
{txt}
{com}. 
. gen logsdp = log(sdp)
{txt}(18 missing values generated)

{com}. 
. //creating graph of the series
. label var qdate "Time"
{txt}
{com}. tsset qdate
{res}{txt}{col 9}time variable:  {res}{col 25}qdate, 1996q1 to 2019q4
{txt}{col 17}delta:  {res}1 quarter
{txt}
{com}. //graph twoway tsline logpublic logprivate logsdp, title("Private, Public, and SDP Series")
. graph twoway tsline logpublic logprivate logsdp, title("Private investment, Public investment, and SDP: Rajasthan")
{res}{txt}
{com}. cd "/Users/shraddhaanand/Documents/Classes/Spring 2020/MIT 14.33/Homework/Data/State Stata files"
{res}/Users/shraddhaanand/Documents/Classes/Spring 2020/MIT 14.33/Homework/Data/State Stata files
{txt}
{com}. 
. 
. //ANALYSIS
. 
. tsset qdate, quarterly
{res}{txt}{col 9}time variable:  {res}{col 25}qdate, 1996q1 to 2019q4
{txt}{col 17}delta:  {res}1 quarter
{txt}
{com}. varsoc logprivate logpublic logsdp

{txt}{col 4}Selection-order criteria
{col 4}Sample:  {res}1997q1 - 2015q2 {txt}{col 49}Number of obs {col 68}= {res}       74
{col 3}{text}{c TLC}{hline 4}{c TT}{hline 9}{hline 8}{hline 1}{hline 5}{hline 7}{hline 8}{hline 1}{hline 9}{hline 1}{hline 9}{hline 1}{hline 9}{hline 1}{hline 1}{c TRC}
{col 3}{text}{c |}lag{col 8}{c |}    LL  {col 18}   LR  {col 27}  df{col 32}   p  {col 39}   FPE {col 48}    AIC {col 58}   HQIC {col 68}   SBIC {col 79}{c |}
{res}{col 3}{text}{c LT}{hline 4}{c +}{hline 9}{hline 8}{hline 1}{hline 5}{hline 7}{hline 8}{hline 1}{hline 9}{hline 1}{hline 9}{hline 1}{hline 9}{hline 1}{hline 1}{c RT}
{col 3}{text}{c |}  0{col 8}{c |}{result}{space 1}-34.8823{col 18}{col 27}{col 32}{col 39} .000559{col 48}{space 1} 1.02384{col 58}{space 1} 1.06111{col 68}{space 1} 1.11725{col 79}{text}{c |}
{res}{col 3}{text}{c |}  1{col 8}{c |}{result}{space 1} 152.776{col 18}{space 1} 375.32{col 27}   9{col 32} 0.000{col 39} 4.5e-06{col 47}*{col 48}{space 1}-3.80477{col 57}*{col 58}{space 1}-3.65572{col 67}*{col 68}{space 1}-3.43113{col 77}*{col 79}{text}{c |}
{res}{col 3}{text}{c |}  2{col 8}{c |}{result}{space 1}  160.31{col 18}{space 1} 15.068{col 27}   9{col 32} 0.089{col 39} 4.7e-06{col 48}{space 1}-3.76514{col 58}{space 1}-3.50431{col 68}{space 1}-3.11128{col 79}{text}{c |}
{res}{col 3}{text}{c |}  3{col 8}{c |}{result}{space 1} 170.269{col 18}{space 1} 19.917{col 26}*{col 27}   9{col 32} 0.018{col 39} 4.6e-06{col 48}{space 1}-3.79104{col 58}{space 1}-3.41843{col 68}{space 1}-2.85696{col 79}{text}{c |}
{res}{col 3}{text}{c |}  4{col 8}{c |}{result}{space 1} 174.504{col 18}{space 1} 8.4718{col 27}   9{col 32} 0.487{col 39} 5.2e-06{col 48}{space 1}-3.66228{col 58}{space 1}-3.17788{col 68}{space 1}-2.44798{col 79}{text}{c |}
{res}{col 3}{text}{c BLC}{hline 4}{c BT}{hline 9}{hline 8}{hline 1}{hline 5}{hline 7}{hline 8}{hline 1}{hline 9}{hline 1}{hline 9}{hline 1}{hline 9}{hline 1}{hline 1}{c BRC}
{res}{txt}{space 3}Endogenous:  logprivate logpublic logsdp
{space 3} Exogenous:  _cons

{com}. //lag = 1
. 
. //check for stationarity
. corrgram logprivate

{txt}{col 43}-1       0       1 -1       0       1
 LAG       AC       PAC      Q     Prob>Q  [Autocorrelation]  [Partial Autocor]
{hline 79}
1     {res}{col 9} 0.9763{col 18} 0.9765{col 27} 94.387{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1} {col 63}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1} 
{txt}2     {res}{col 9} 0.9566{col 18} 0.0269{col 27} 185.98{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1} {col 63}        {c |}        
{txt}3     {res}{col 9} 0.9359{col 18}-0.0687{col 27}  274.6{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1} {col 63}        {c |}        
{txt}4     {res}{col 9} 0.9173{col 18} 0.0785{col 27} 360.64{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1} {col 63}        {c |}        
{txt}5     {res}{col 9} 0.8887{col 18}-0.1281{col 27} 442.28{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1} {col 63}       {hline 1}{c RT}        
{txt}6     {res}{col 9} 0.8653{col 18} 0.0914{col 27} 520.56{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}  {col 63}        {c |}        
{txt}7     {res}{col 9} 0.8408{col 18}-0.0385{col 27} 595.28{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}  {col 63}        {c |}        
{txt}8     {res}{col 9} 0.8131{col 18}-0.0180{col 27} 665.97{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}  {col 63}        {c |}        
{txt}9     {res}{col 9} 0.7776{col 18}-0.1615{col 27} 731.36{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}  {col 63}       {hline 1}{c RT}        
{txt}10    {res}{col 9} 0.7409{col 18}-0.0714{col 27} 791.42{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}   {col 63}        {c |}        
{txt}11    {res}{col 9} 0.7029{col 18}-0.0005{col 27} 846.11{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}   {col 63}        {c |}        
{txt}12    {res}{col 9} 0.6652{col 18}-0.0451{col 27} 895.66{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}   {col 63}        {c |}        
{txt}13    {res}{col 9} 0.6251{col 18}-0.1118{col 27} 939.95{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}   {col 63}        {c |}        
{txt}14    {res}{col 9} 0.5842{col 18}-0.1132{col 27} 979.11{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}    {col 63}        {c |}        
{txt}15    {res}{col 9} 0.5462{col 18} 0.0257{col 27} 1013.8{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}    {col 63}        {c |}        
{txt}16    {res}{col 9} 0.5061{col 18}-0.0610{col 27} 1043.9{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}    {col 63}        {c |}        
{txt}17    {res}{col 9} 0.4581{col 18}-0.2475{col 27} 1068.9{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}     {col 63}       {hline 1}{c RT}        
{txt}18    {res}{col 9} 0.4146{col 18} 0.1187{col 27} 1089.6{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}     {col 63}        {c |}        
{txt}19    {res}{col 9} 0.3703{col 18}-0.1460{col 27} 1106.4{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}      {col 63}       {hline 1}{c RT}        
{txt}20    {res}{col 9} 0.3295{col 18}-0.0299{col 27} 1119.8{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}      {col 63}        {c |}        
{txt}21    {res}{col 9} 0.2870{col 18}-0.2161{col 27} 1130.1{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}      {col 63}       {hline 1}{c RT}        
{txt}22    {res}{col 9} 0.2458{col 18}-0.1128{col 27} 1137.8{col 36}0.0000{col 44}        {c LT}{hline 1}       {col 63}        {c |}        
{txt}23    {res}{col 9} 0.2031{col 18}-0.0585{col 27} 1143.1{col 36}0.0000{col 44}        {c LT}{hline 1}       {col 63}        {c |}        
{txt}24    {res}{col 9} 0.1637{col 18}-0.0109{col 27} 1146.6{col 36}0.0000{col 44}        {c LT}{hline 1}       {col 63}        {c |}        
{txt}25    {res}{col 9} 0.1173{col 18}-0.0474{col 27} 1148.5{col 36}0.0000{col 44}        {c |}        {col 63}        {c |}        
{txt}26    {res}{col 9} 0.0767{col 18} 0.0010{col 27} 1149.3{col 36}0.0000{col 44}        {c |}        {col 63}        {c |}        
{txt}27    {res}{col 9} 0.0389{col 18} 0.1324{col 27} 1149.5{col 36}0.0000{col 44}        {c |}        {col 63}        {c LT}{hline 1}       
{txt}28    {res}{col 9} 0.0022{col 18}-0.0973{col 27} 1149.5{col 36}0.0000{col 44}        {c |}        {col 63}        {c |}        
{txt}29    {res}{col 9}-0.0381{col 18}-0.0177{col 27} 1149.7{col 36}0.0000{col 44}        {c |}        {col 63}        {c |}        
{txt}30    {res}{col 9}-0.0732{col 18} 0.0126{col 27} 1150.4{col 36}0.0000{col 44}        {c |}        {col 63}        {c |}        
{txt}31    {res}{col 9}-0.1087{col 18}-0.2378{col 27} 1152.1{col 36}0.0000{col 44}        {c |}        {col 63}       {hline 1}{c RT}        
{txt}32    {res}{col 9}-0.1413{col 18} 0.0527{col 27} 1155.1{col 36}0.0000{col 44}       {hline 1}{c RT}        {col 63}        {c |}        
{txt}33    {res}{col 9}-0.1794{col 18}-0.3346{col 27} 1159.9{col 36}0.0000{col 44}       {hline 1}{c RT}        {col 63}      {hline 1}{hline 1}{c RT}        
{txt}34    {res}{col 9}-0.2059{col 18} 0.1987{col 27} 1166.3{col 36}0.0000{col 44}       {hline 1}{c RT}        {col 63}        {c LT}{hline 1}       
{txt}35    {res}{col 9}-0.2300{col 18}-0.0404{col 27} 1174.5{col 36}0.0000{col 44}       {hline 1}{c RT}        {col 63}        {c |}        
{txt}36    {res}{col 9}-0.2514{col 18}-0.0557{col 27} 1184.4{col 36}0.0000{col 44}      {hline 1}{hline 1}{c RT}        {col 63}        {c |}        
{txt}37    {res}{col 9}-0.2775{col 18}-0.2097{col 27} 1196.7{col 36}0.0000{col 44}      {hline 1}{hline 1}{c RT}        {col 63}       {hline 1}{c RT}        
{txt}38    {res}{col 9}-0.3040{col 18}-0.3723{col 27} 1211.7{col 36}0.0000{col 44}      {hline 1}{hline 1}{c RT}        {col 63}      {hline 1}{hline 1}{c RT}        
{txt}39    {res}{col 9}-0.3295{col 18}-0.3982{col 27} 1229.6{col 36}0.0000{col 44}      {hline 1}{hline 1}{c RT}        {col 63}     {hline 1}{hline 1}{hline 1}{c RT}        
{txt}40    {res}{col 9}-0.3484{col 18} 0.2595{col 27}   1250{col 36}0.0000{col 44}      {hline 1}{hline 1}{c RT}        {col 63}        {c LT}{hline 1}{hline 1}      
{txt}
{com}. //no
. corrgram logpublic

{txt}{col 43}-1       0       1 -1       0       1
 LAG       AC       PAC      Q     Prob>Q  [Autocorrelation]  [Partial Autocor]
{hline 79}
1     {res}{col 9} 0.9397{col 18} 0.9480{col 27} 87.452{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1} {col 63}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1} 
{txt}2     {res}{col 9} 0.8809{col 18} 0.0873{col 27} 165.11{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1} {col 63}        {c |}        
{txt}3     {res}{col 9} 0.8276{col 18} 0.1018{col 27} 234.39{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}  {col 63}        {c |}        
{txt}4     {res}{col 9} 0.7787{col 18} 0.1191{col 27} 296.39{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}  {col 63}        {c |}        
{txt}5     {res}{col 9} 0.7349{col 18}-0.0181{col 27} 352.23{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}   {col 63}        {c |}        
{txt}6     {res}{col 9} 0.6846{col 18}-0.0665{col 27} 401.22{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}   {col 63}        {c |}        
{txt}7     {res}{col 9} 0.6338{col 18} 0.0593{col 27} 443.68{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}   {col 63}        {c |}        
{txt}8     {res}{col 9} 0.5835{col 18} 0.0395{col 27} 480.08{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}    {col 63}        {c |}        
{txt}9     {res}{col 9} 0.5489{col 18} 0.0427{col 27} 512.67{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}    {col 63}        {c |}        
{txt}10    {res}{col 9} 0.5178{col 18} 0.1333{col 27} 541.99{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}    {col 63}        {c LT}{hline 1}       
{txt}11    {res}{col 9} 0.4750{col 18}-0.1569{col 27} 566.97{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}     {col 63}       {hline 1}{c RT}        
{txt}12    {res}{col 9} 0.4373{col 18} 0.0845{col 27} 588.38{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}     {col 63}        {c |}        
{txt}13    {res}{col 9} 0.3998{col 18} 0.1076{col 27}  606.5{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}     {col 63}        {c |}        
{txt}14    {res}{col 9} 0.3708{col 18} 0.1929{col 27} 622.27{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}      {col 63}        {c LT}{hline 1}       
{txt}15    {res}{col 9} 0.3442{col 18}-0.1345{col 27} 636.04{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}      {col 63}       {hline 1}{c RT}        
{txt}16    {res}{col 9} 0.3193{col 18} 0.0671{col 27} 648.03{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}      {col 63}        {c |}        
{txt}17    {res}{col 9} 0.2936{col 18} 0.0890{col 27}  658.3{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}      {col 63}        {c |}        
{txt}18    {res}{col 9} 0.2699{col 18}-0.0609{col 27} 667.08{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}      {col 63}        {c |}        
{txt}19    {res}{col 9} 0.2413{col 18} 0.1499{col 27}  674.2{col 36}0.0000{col 44}        {c LT}{hline 1}       {col 63}        {c LT}{hline 1}       
{txt}20    {res}{col 9} 0.2151{col 18}-0.0422{col 27} 679.92{col 36}0.0000{col 44}        {c LT}{hline 1}       {col 63}        {c |}        
{txt}21    {res}{col 9} 0.1889{col 18}-0.0666{col 27}  684.4{col 36}0.0000{col 44}        {c LT}{hline 1}       {col 63}        {c |}        
{txt}22    {res}{col 9} 0.1810{col 18} 0.1409{col 27} 688.57{col 36}0.0000{col 44}        {c LT}{hline 1}       {col 63}        {c LT}{hline 1}       
{txt}23    {res}{col 9} 0.1786{col 18} 0.1675{col 27} 692.68{col 36}0.0000{col 44}        {c LT}{hline 1}       {col 63}        {c LT}{hline 1}       
{txt}24    {res}{col 9} 0.1682{col 18}-0.1582{col 27} 696.37{col 36}0.0000{col 44}        {c LT}{hline 1}       {col 63}       {hline 1}{c RT}        
{txt}25    {res}{col 9} 0.1477{col 18} 0.1084{col 27} 699.26{col 36}0.0000{col 44}        {c LT}{hline 1}       {col 63}        {c |}        
{txt}26    {res}{col 9} 0.1255{col 18}-0.1458{col 27} 701.38{col 36}0.0000{col 44}        {c LT}{hline 1}       {col 63}       {hline 1}{c RT}        
{txt}27    {res}{col 9} 0.1149{col 18} 0.3170{col 27} 703.18{col 36}0.0000{col 44}        {c |}        {col 63}        {c LT}{hline 1}{hline 1}      
{txt}28    {res}{col 9} 0.1059{col 18} 0.0410{col 27} 704.73{col 36}0.0000{col 44}        {c |}        {col 63}        {c |}        
{txt}29    {res}{col 9} 0.0876{col 18} 0.0512{col 27} 705.81{col 36}0.0000{col 44}        {c |}        {col 63}        {c |}        
{txt}30    {res}{col 9} 0.0746{col 18} 0.1344{col 27}  706.6{col 36}0.0000{col 44}        {c |}        {col 63}        {c LT}{hline 1}       
{txt}31    {res}{col 9} 0.0533{col 18}-0.2224{col 27} 707.01{col 36}0.0000{col 44}        {c |}        {col 63}       {hline 1}{c RT}        
{txt}32    {res}{col 9} 0.0448{col 18} 0.1693{col 27} 707.31{col 36}0.0000{col 44}        {c |}        {col 63}        {c LT}{hline 1}       
{txt}33    {res}{col 9} 0.0246{col 18} 0.0235{col 27}  707.4{col 36}0.0000{col 44}        {c |}        {col 63}        {c |}        
{txt}34    {res}{col 9}-0.0018{col 18} 0.0771{col 27}  707.4{col 36}0.0000{col 44}        {c |}        {col 63}        {c |}        
{txt}35    {res}{col 9}-0.0280{col 18} 0.1203{col 27} 707.52{col 36}0.0000{col 44}        {c |}        {col 63}        {c |}        
{txt}36    {res}{col 9}-0.0463{col 18} 0.3177{col 27} 707.85{col 36}0.0000{col 44}        {c |}        {col 63}        {c LT}{hline 1}{hline 1}      
{txt}37    {res}{col 9}-0.0586{col 18} 0.1927{col 27}  708.4{col 36}0.0000{col 44}        {c |}        {col 63}        {c LT}{hline 1}       
{txt}38    {res}{col 9}-0.0786{col 18}-0.0454{col 27}  709.4{col 36}0.0000{col 44}        {c |}        {col 63}        {c |}        
{txt}39    {res}{col 9}-0.0930{col 18} 0.1298{col 27} 710.83{col 36}0.0000{col 44}        {c |}        {col 63}        {c LT}{hline 1}       
{txt}40    {res}{col 9}-0.1000{col 18} 0.3507{col 27} 712.51{col 36}0.0000{col 44}        {c |}        {col 63}        {c LT}{hline 1}{hline 1}      
{txt}
{com}. //no 
. corrgram logsdp

{txt}{col 43}-1       0       1 -1       0       1
 LAG       AC       PAC      Q     Prob>Q  [Autocorrelation]  [Partial Autocor]
{hline 79}
1     {res}{col 9} 0.8118{col 18} 0.8406{col 27} 53.411{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}  {col 63}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}  
{txt}2     {res}{col 9} 0.7675{col 18} 0.4236{col 27} 101.77{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}  {col 63}        {c LT}{hline 1}{hline 1}{hline 1}     
{txt}3     {res}{col 9} 0.7293{col 18} 0.2996{col 27} 146.03{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}   {col 63}        {c LT}{hline 1}{hline 1}      
{txt}4     {res}{col 9} 0.6995{col 18} 0.2791{col 27} 187.28{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}   {col 63}        {c LT}{hline 1}{hline 1}      
{txt}5     {res}{col 9} 0.6595{col 18} 0.2161{col 27} 224.46{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}   {col 63}        {c LT}{hline 1}       
{txt}6     {res}{col 9} 0.6797{col 18} 0.0922{col 27}  264.5{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}   {col 63}        {c |}        
{txt}7     {res}{col 9} 0.6544{col 18} 0.0781{col 27} 302.13{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}   {col 63}        {c |}        
{txt}8     {res}{col 9} 0.6323{col 18} 0.1064{col 27} 337.77{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}{hline 1}   {col 63}        {c |}        
{txt}9     {res}{col 9} 0.5941{col 18} 0.0023{col 27} 369.69{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}    {col 63}        {c |}        
{txt}10    {res}{col 9} 0.5483{col 18}-0.0311{col 27} 397.28{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}    {col 63}        {c |}        
{txt}11    {res}{col 9} 0.5200{col 18} 0.0103{col 27} 422.46{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}{hline 1}    {col 63}        {c |}        
{txt}12    {res}{col 9} 0.4956{col 18} 0.0103{col 27} 445.68{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}     {col 63}        {c |}        
{txt}13    {res}{col 9} 0.4542{col 18}-0.0433{col 27} 465.49{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}     {col 63}        {c |}        
{txt}14    {res}{col 9} 0.4123{col 18}-0.0182{col 27} 482.06{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}     {col 63}        {c |}        
{txt}15    {res}{col 9} 0.3831{col 18}-0.0029{col 27}  496.6{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}{hline 1}     {col 63}        {c |}        
{txt}16    {res}{col 9} 0.3574{col 18}-0.0051{col 27} 509.45{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}      {col 63}        {c |}        
{txt}17    {res}{col 9} 0.3303{col 18} 0.0447{col 27} 520.61{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}      {col 63}        {c |}        
{txt}18    {res}{col 9} 0.2915{col 18}-0.0020{col 27} 529.45{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}      {col 63}        {c |}        
{txt}19    {res}{col 9} 0.2604{col 18} 0.0050{col 27} 536.63{col 36}0.0000{col 44}        {c LT}{hline 1}{hline 1}      {col 63}        {c |}        
{txt}20    {res}{col 9} 0.2332{col 18} 0.0039{col 27} 542.48{col 36}0.0000{col 44}        {c LT}{hline 1}       {col 63}        {c |}        
{txt}21    {res}{col 9} 0.1932{col 18}-0.0715{col 27} 546.57{col 36}0.0000{col 44}        {c LT}{hline 1}       {col 63}        {c |}        
{txt}22    {res}{col 9} 0.1578{col 18}-0.0082{col 27} 549.34{col 36}0.0000{col 44}        {c LT}{hline 1}       {col 63}        {c |}        
{txt}23    {res}{col 9} 0.1325{col 18}-0.0266{col 27} 551.33{col 36}0.0000{col 44}        {c LT}{hline 1}       {col 63}        {c |}        
{txt}24    {res}{col 9} 0.1112{col 18}-0.0210{col 27} 552.76{col 36}0.0000{col 44}        {c |}        {col 63}        {c |}        
{txt}25    {res}{col 9} 0.0976{col 18} 0.1274{col 27} 553.88{col 36}0.0000{col 44}        {c |}        {col 63}        {c LT}{hline 1}       
{txt}26    {res}{col 9} 0.0606{col 18}-0.0356{col 27} 554.33{col 36}0.0000{col 44}        {c |}        {col 63}        {c |}        
{txt}27    {res}{col 9} 0.0265{col 18}-0.0029{col 27} 554.41{col 36}0.0000{col 44}        {c |}        {col 63}        {c |}        
{txt}28    {res}{col 9}-0.0017{col 18}-0.0104{col 27} 554.41{col 36}0.0000{col 44}        {c |}        {col 63}        {c |}        
{txt}29    {res}{col 9}-0.0213{col 18} 0.0329{col 27} 554.47{col 36}0.0000{col 44}        {c |}        {col 63}        {c |}        
{txt}30    {res}{col 9}-0.0620{col 18}-0.0273{col 27} 554.97{col 36}0.0000{col 44}        {c |}        {col 63}        {c |}        
{txt}31    {res}{col 9}-0.0910{col 18}-0.0116{col 27} 556.07{col 36}0.0000{col 44}        {c |}        {col 63}        {c |}        
{txt}32    {res}{col 9}-0.1142{col 18}-0.0468{col 27} 557.84{col 36}0.0000{col 44}        {c |}        {col 63}        {c |}        
{txt}33    {res}{col 9}-0.1363{col 18}-0.0607{col 27} 560.41{col 36}0.0000{col 44}       {hline 1}{c RT}        {col 63}        {c |}        
{txt}34    {res}{col 9}-0.1699{col 18}-0.0467{col 27}  564.5{col 36}0.0000{col 44}       {hline 1}{c RT}        {col 63}        {c |}        
{txt}35    {res}{col 9}-0.1955{col 18}-0.0691{col 27} 570.05{col 36}0.0000{col 44}       {hline 1}{c RT}        {col 63}        {c |}        
{txt}36    {res}{col 9}-0.2125{col 18}-0.1111{col 27} 576.76{col 36}0.0000{col 44}       {hline 1}{c RT}        {col 63}        {c |}        
{txt}37    {res}{col 9}-0.2166{col 18} 0.0039{col 27} 583.89{col 36}0.0000{col 44}       {hline 1}{c RT}        {col 63}        {c |}        
{txt}
{com}. //no
. 
. corrgram d.logprivate

{txt}{col 43}-1       0       1 -1       0       1
 LAG       AC       PAC      Q     Prob>Q  [Autocorrelation]  [Partial Autocor]
{hline 79}
1     {res}{col 9}-0.0327{col 18}-0.0328{col 27} .10486{col 36}0.7461{col 44}        {c |}        {col 63}        {c |}        
{txt}2     {res}{col 9} 0.0639{col 18} 0.0632{col 27} .50954{col 36}0.7751{col 44}        {c |}        {col 63}        {c |}        
{txt}3     {res}{col 9}-0.0871{col 18}-0.0849{col 27} 1.2686{col 36}0.7366{col 44}        {c |}        {col 63}        {c |}        
{txt}4     {res}{col 9} 0.1260{col 18} 0.1213{col 27} 2.8755{col 36}0.5789{col 44}        {c LT}{hline 1}       {col 63}        {c |}        
{txt}5     {res}{col 9}-0.1085{col 18}-0.1005{col 27} 4.0798{col 36}0.5380{col 44}        {c |}        {col 63}        {c |}        
{txt}6     {res}{col 9} 0.0529{col 18} 0.0317{col 27} 4.3697{col 36}0.6268{col 44}        {c |}        {col 63}        {c |}        
{txt}7     {res}{col 9}-0.0269{col 18} 0.0089{col 27} 4.4456{col 36}0.7273{col 44}        {c |}        {col 63}        {c |}        
{txt}8     {res}{col 9} 0.1753{col 18} 0.1505{col 27} 7.6993{col 36}0.4634{col 44}        {c LT}{hline 1}       {col 63}        {c LT}{hline 1}       
{txt}9     {res}{col 9} 0.0103{col 18} 0.0516{col 27} 7.7107{col 36}0.5635{col 44}        {c |}        {col 63}        {c |}        
{txt}10    {res}{col 9} 0.0201{col 18}-0.0237{col 27} 7.7544{col 36}0.6528{col 44}        {c |}        {col 63}        {c |}        
{txt}11    {res}{col 9}-0.0167{col 18} 0.0201{col 27} 7.7848{col 36}0.7324{col 44}        {c |}        {col 63}        {c |}        
{txt}12    {res}{col 9} 0.1134{col 18} 0.0863{col 27}  9.212{col 36}0.6847{col 44}        {c |}        {col 63}        {c |}        
{txt}13    {res}{col 9} 0.0333{col 18} 0.0791{col 27} 9.3368{col 36}0.7471{col 44}        {c |}        {col 63}        {c |}        
{txt}14    {res}{col 9}-0.0234{col 18}-0.0663{col 27} 9.3992{col 36}0.8047{col 44}        {c |}        {col 63}        {c |}        
{txt}15    {res}{col 9}-0.0072{col 18} 0.0196{col 27} 9.4052{col 36}0.8554{col 44}        {c |}        {col 63}        {c |}        
{txt}16    {res}{col 9} 0.1869{col 18} 0.1944{col 27} 13.479{col 36}0.6374{col 44}        {c LT}{hline 1}       {col 63}        {c LT}{hline 1}       
{txt}17    {res}{col 9}-0.1416{col 18}-0.1936{col 27} 15.847{col 36}0.5347{col 44}       {hline 1}{c RT}        {col 63}       {hline 1}{c RT}        
{txt}18    {res}{col 9} 0.0757{col 18} 0.0874{col 27} 16.532{col 36}0.5555{col 44}        {c |}        {col 63}        {c |}        
{txt}19    {res}{col 9}-0.0554{col 18}-0.0354{col 27} 16.903{col 36}0.5964{col 44}        {c |}        {col 63}        {c |}        
{txt}20    {res}{col 9} 0.1765{col 18} 0.1576{col 27} 20.731{col 36}0.4131{col 44}        {c LT}{hline 1}       {col 63}        {c LT}{hline 1}       
{txt}21    {res}{col 9}-0.0426{col 18} 0.0291{col 27} 20.957{col 36}0.4616{col 44}        {c |}        {col 63}        {c |}        
{txt}22    {res}{col 9} 0.0299{col 18}-0.0361{col 27}  21.07{col 36}0.5164{col 44}        {c |}        {col 63}        {c |}        
{txt}23    {res}{col 9}-0.1034{col 18}-0.0781{col 27} 22.438{col 36}0.4939{col 44}        {c |}        {col 63}        {c |}        
{txt}24    {res}{col 9} 0.0795{col 18}-0.0476{col 27} 23.258{col 36}0.5046{col 44}        {c |}        {col 63}        {c |}        
{txt}25    {res}{col 9}-0.1240{col 18}-0.0844{col 27} 25.282{col 36}0.4467{col 44}        {c |}        {col 63}        {c |}        
{txt}26    {res}{col 9}-0.1013{col 18}-0.2026{col 27} 26.652{col 36}0.4278{col 44}        {c |}        {col 63}       {hline 1}{c RT}        
{txt}27    {res}{col 9}-0.0428{col 18} 0.0345{col 27}   26.9{col 36}0.4692{col 44}        {c |}        {col 63}        {c |}        
{txt}28    {res}{col 9} 0.0888{col 18}-0.0532{col 27} 27.984{col 36}0.4653{col 44}        {c |}        {col 63}        {c |}        
{txt}29    {res}{col 9}-0.0500{col 18}-0.0719{col 27} 28.334{col 36}0.5001{col 44}        {c |}        {col 63}        {c |}        
{txt}30    {res}{col 9} 0.0492{col 18} 0.1695{col 27} 28.676{col 36}0.5346{col 44}        {c |}        {col 63}        {c LT}{hline 1}       
{txt}31    {res}{col 9}-0.0525{col 18}-0.1644{col 27} 29.073{col 36}0.5654{col 44}        {c |}        {col 63}       {hline 1}{c RT}        
{txt}32    {res}{col 9} 0.1324{col 18} 0.2040{col 27} 31.637{col 36}0.4849{col 44}        {c LT}{hline 1}       {col 63}        {c LT}{hline 1}       
{txt}33    {res}{col 9}-0.1366{col 18}-0.2914{col 27}  34.41{col 36}0.4001{col 44}       {hline 1}{c RT}        {col 63}      {hline 1}{hline 1}{c RT}        
{txt}34    {res}{col 9}-0.0553{col 18}-0.0420{col 27} 34.872{col 36}0.4264{col 44}        {c |}        {col 63}        {c |}        
{txt}35    {res}{col 9}-0.0846{col 18}-0.0462{col 27} 35.972{col 36}0.4228{col 44}        {c |}        {col 63}        {c |}        
{txt}36    {res}{col 9} 0.1103{col 18} 0.1015{col 27} 37.871{col 36}0.3839{col 44}        {c |}        {col 63}        {c |}        
{txt}37    {res}{col 9} 0.0434{col 18} 0.1849{col 27}  38.17{col 36}0.4160{col 44}        {c |}        {col 63}        {c LT}{hline 1}       
{txt}38    {res}{col 9} 0.0295{col 18} 0.0424{col 27} 38.311{col 36}0.4554{col 44}        {c |}        {col 63}        {c |}        
{txt}39    {res}{col 9}-0.1839{col 18}-0.4558{col 27} 43.874{col 36}0.2725{col 44}       {hline 1}{c RT}        {col 63}     {hline 1}{hline 1}{hline 1}{c RT}        
{txt}40    {res}{col 9}-0.0120{col 18} 0.0054{col 27} 43.898{col 36}0.3098{col 44}        {c |}        {col 63}        {c |}        
{txt}
{com}. //yes
. corrgram d.logpublic

{txt}{col 43}-1       0       1 -1       0       1
 LAG       AC       PAC      Q     Prob>Q  [Autocorrelation]  [Partial Autocor]
{hline 79}
1     {res}{col 9}-0.1001{col 18}-0.1039{col 27} .98296{col 36}0.3215{col 44}        {c |}        {col 63}        {c |}        
{txt}2     {res}{col 9}-0.0981{col 18}-0.1163{col 27}  1.937{col 36}0.3797{col 44}        {c |}        {col 63}        {c |}        
{txt}3     {res}{col 9}-0.0955{col 18}-0.1315{col 27} 2.8496{col 36}0.4154{col 44}        {c |}        {col 63}       {hline 1}{c RT}        
{txt}4     {res}{col 9} 0.0442{col 18} 0.0177{col 27} 3.0472{col 36}0.5500{col 44}        {c |}        {col 63}        {c |}        
{txt}5     {res}{col 9} 0.0643{col 18} 0.0643{col 27} 3.4711{col 36}0.6278{col 44}        {c |}        {col 63}        {c |}        
{txt}6     {res}{col 9}-0.0634{col 18}-0.0691{col 27} 3.8869{col 36}0.6920{col 44}        {c |}        {col 63}        {c |}        
{txt}7     {res}{col 9}-0.0317{col 18}-0.0477{col 27} 3.9924{col 36}0.7806{col 44}        {c |}        {col 63}        {c |}        
{txt}8     {res}{col 9}-0.0246{col 18}-0.0481{col 27} 4.0567{col 36}0.8520{col 44}        {c |}        {col 63}        {c |}        
{txt}9     {res}{col 9}-0.0798{col 18}-0.1399{col 27} 4.7389{col 36}0.8564{col 44}        {c |}        {col 63}       {hline 1}{c RT}        
{txt}10    {res}{col 9} 0.1591{col 18} 0.1536{col 27} 7.4822{col 36}0.6793{col 44}        {c LT}{hline 1}       {col 63}        {c LT}{hline 1}       
{txt}11    {res}{col 9}-0.0913{col 18}-0.0923{col 27} 8.3975{col 36}0.6773{col 44}        {c |}        {col 63}        {c |}        
{txt}12    {res}{col 9}-0.0713{col 18}-0.1166{col 27} 8.9621{col 36}0.7062{col 44}        {c |}        {col 63}        {c |}        
{txt}13    {res}{col 9}-0.1370{col 18}-0.1992{col 27} 11.071{col 36}0.6048{col 44}       {hline 1}{c RT}        {col 63}       {hline 1}{c RT}        
{txt}14    {res}{col 9} 0.1222{col 18} 0.1550{col 27}  12.77{col 36}0.5447{col 44}        {c |}        {col 63}        {c LT}{hline 1}       
{txt}15    {res}{col 9}-0.0156{col 18}-0.0496{col 27} 12.798{col 36}0.6179{col 44}        {c |}        {col 63}        {c |}        
{txt}16    {res}{col 9}-0.0452{col 18}-0.0659{col 27} 13.037{col 36}0.6701{col 44}        {c |}        {col 63}        {c |}        
{txt}17    {res}{col 9} 0.0282{col 18} 0.0854{col 27} 13.131{col 36}0.7274{col 44}        {c |}        {col 63}        {c |}        
{txt}18    {res}{col 9}-0.0253{col 18}-0.1218{col 27} 13.207{col 36}0.7791{col 44}        {c |}        {col 63}        {c |}        
{txt}19    {res}{col 9} 0.0606{col 18} 0.0861{col 27} 13.653{col 36}0.8036{col 44}        {c |}        {col 63}        {c |}        
{txt}20    {res}{col 9} 0.0407{col 18} 0.0849{col 27} 13.856{col 36}0.8377{col 44}        {c |}        {col 63}        {c |}        
{txt}21    {res}{col 9}-0.0864{col 18}-0.1314{col 27} 14.786{col 36}0.8335{col 44}        {c |}        {col 63}       {hline 1}{c RT}        
{txt}22    {res}{col 9}-0.0359{col 18}-0.1558{col 27} 14.949{col 36}0.8644{col 44}        {c |}        {col 63}       {hline 1}{c RT}        
{txt}23    {res}{col 9} 0.0931{col 18} 0.1677{col 27} 16.059{col 36}0.8527{col 44}        {c |}        {col 63}        {c LT}{hline 1}       
{txt}24    {res}{col 9} 0.0321{col 18}-0.0961{col 27} 16.192{col 36}0.8810{col 44}        {c |}        {col 63}        {c |}        
{txt}25    {res}{col 9} 0.0430{col 18} 0.1661{col 27} 16.436{col 36}0.9012{col 44}        {c |}        {col 63}        {c LT}{hline 1}       
{txt}26    {res}{col 9}-0.1854{col 18}-0.2986{col 27} 21.026{col 36}0.7406{col 44}       {hline 1}{c RT}        {col 63}      {hline 1}{hline 1}{c RT}        
{txt}27    {res}{col 9} 0.0322{col 18}-0.0159{col 27} 21.167{col 36}0.7784{col 44}        {c |}        {col 63}        {c |}        
{txt}28    {res}{col 9} 0.0430{col 18}-0.0237{col 27} 21.421{col 36}0.8074{col 44}        {c |}        {col 63}        {c |}        
{txt}29    {res}{col 9}-0.0716{col 18}-0.0919{col 27} 22.137{col 36}0.8145{col 44}        {c |}        {col 63}        {c |}        
{txt}30    {res}{col 9} 0.1132{col 18} 0.2820{col 27} 23.955{col 36}0.7741{col 44}        {c |}        {col 63}        {c LT}{hline 1}{hline 1}      
{txt}31    {res}{col 9}-0.0869{col 18}-0.1237{col 27} 25.042{col 36}0.7659{col 44}        {c |}        {col 63}        {c |}        
{txt}32    {res}{col 9} 0.0157{col 18} 0.0174{col 27} 25.077{col 36}0.8029{col 44}        {c |}        {col 63}        {c |}        
{txt}33    {res}{col 9} 0.0615{col 18}-0.0376{col 27}  25.64{col 36}0.8159{col 44}        {c |}        {col 63}        {c |}        
{txt}34    {res}{col 9}-0.0219{col 18}-0.0647{col 27} 25.712{col 36}0.8457{col 44}        {c |}        {col 63}        {c |}        
{txt}35    {res}{col 9}-0.0728{col 18}-0.2287{col 27} 26.527{col 36}0.8478{col 44}        {c |}        {col 63}       {hline 1}{c RT}        
{txt}36    {res}{col 9}-0.0957{col 18}-0.0216{col 27} 27.958{col 36}0.8287{col 44}        {c |}        {col 63}        {c |}        
{txt}37    {res}{col 9} 0.1611{col 18} 0.2531{col 27} 32.081{col 36}0.6988{col 44}        {c LT}{hline 1}       {col 63}        {c LT}{hline 1}{hline 1}      
{txt}38    {res}{col 9} 0.0490{col 18} 0.0067{col 27} 32.469{col 36}0.7226{col 44}        {c |}        {col 63}        {c |}        
{txt}39    {res}{col 9}-0.0169{col 18}-0.1897{col 27} 32.516{col 36}0.7589{col 44}        {c |}        {col 63}       {hline 1}{c RT}        
{txt}40    {res}{col 9} 0.0199{col 18} 0.0908{col 27} 32.582{col 36}0.7914{col 44}        {c |}        {col 63}        {c |}        
{txt}
{com}. //yes
. corrgram d.logsdp

{txt}{col 43}-1       0       1 -1       0       1
 LAG       AC       PAC      Q     Prob>Q  [Autocorrelation]  [Partial Autocor]
{hline 79}
1     {res}{col 9}-0.4715{col 18}-0.4716{col 27} 17.796{col 36}0.0000{col 44}     {hline 1}{hline 1}{hline 1}{c RT}        {col 63}     {hline 1}{hline 1}{hline 1}{c RT}        
{txt}2     {res}{col 9}-0.0295{col 18}-0.3242{col 27} 17.866{col 36}0.0001{col 44}        {c |}        {col 63}      {hline 1}{hline 1}{c RT}        
{txt}3     {res}{col 9}-0.0326{col 18}-0.2940{col 27} 17.954{col 36}0.0004{col 44}        {c |}        {col 63}      {hline 1}{hline 1}{c RT}        
{txt}4     {res}{col 9} 0.0334{col 18}-0.2267{col 27} 18.046{col 36}0.0012{col 44}        {c |}        {col 63}       {hline 1}{c RT}        
{txt}5     {res}{col 9} 0.0467{col 18}-0.0826{col 27} 18.231{col 36}0.0027{col 44}        {c |}        {col 63}        {c |}        
{txt}6     {res}{col 9}-0.0574{col 18}-0.0709{col 27} 18.513{col 36}0.0051{col 44}        {c |}        {col 63}        {c |}        
{txt}7     {res}{col 9}-0.0154{col 18}-0.0906{col 27} 18.533{col 36}0.0098{col 44}        {c |}        {col 63}        {c |}        
{txt}8     {res}{col 9} 0.0505{col 18} 0.0061{col 27} 18.758{col 36}0.0162{col 44}        {c |}        {col 63}        {c |}        
{txt}9     {res}{col 9} 0.0196{col 18} 0.0351{col 27} 18.792{col 36}0.0270{col 44}        {c |}        {col 63}        {c |}        
{txt}10    {res}{col 9}-0.0506{col 18}-0.0036{col 27} 19.025{col 36}0.0399{col 44}        {c |}        {col 63}        {c |}        
{txt}11    {res}{col 9}-0.0173{col 18}-0.0031{col 27} 19.052{col 36}0.0602{col 44}        {c |}        {col 63}        {c |}        
{txt}12    {res}{col 9} 0.0654{col 18} 0.0460{col 27} 19.452{col 36}0.0782{col 44}        {c |}        {col 63}        {c |}        
{txt}13    {res}{col 9}-0.0027{col 18} 0.0181{col 27} 19.453{col 36}0.1097{col 44}        {c |}        {col 63}        {c |}        
{txt}14    {res}{col 9}-0.0472{col 18} 0.0038{col 27} 19.668{col 36}0.1410{col 44}        {c |}        {col 63}        {c |}        
{txt}15    {res}{col 9}-0.0157{col 18} 0.0048{col 27} 19.693{col 36}0.1840{col 44}        {c |}        {col 63}        {c |}        
{txt}16    {res}{col 9} 0.0259{col 18}-0.0408{col 27} 19.759{col 36}0.2313{col 44}        {c |}        {col 63}        {c |}        
{txt}17    {res}{col 9} 0.0336{col 18} 0.0053{col 27} 19.874{col 36}0.2807{col 44}        {c |}        {col 63}        {c |}        
{txt}18    {res}{col 9}-0.0415{col 18}-0.0011{col 27} 20.052{col 36}0.3299{col 44}        {c |}        {col 63}        {c |}        
{txt}19    {res}{col 9}-0.0174{col 18} 0.0001{col 27} 20.083{col 36}0.3896{col 44}        {c |}        {col 63}        {c |}        
{txt}20    {res}{col 9} 0.0699{col 18} 0.0680{col 27} 20.605{col 36}0.4207{col 44}        {c |}        {col 63}        {c |}        
{txt}21    {res}{col 9}-0.0188{col 18} 0.0049{col 27} 20.643{col 36}0.4809{col 44}        {c |}        {col 63}        {c |}        
{txt}22    {res}{col 9}-0.0355{col 18} 0.0212{col 27} 20.783{col 36}0.5342{col 44}        {c |}        {col 63}        {c |}        
{txt}23    {res}{col 9}-0.0173{col 18} 0.0141{col 27} 20.816{col 36}0.5923{col 44}        {c |}        {col 63}        {c |}        
{txt}24    {res}{col 9}-0.0126{col 18}-0.1242{col 27} 20.835{col 36}0.6485{col 44}        {c |}        {col 63}        {c |}        
{txt}25    {res}{col 9} 0.0720{col 18} 0.0378{col 27} 21.441{col 36}0.6678{col 44}        {c |}        {col 63}        {c |}        
{txt}26    {res}{col 9}-0.0305{col 18} 0.0047{col 27} 21.553{col 36}0.7129{col 44}        {c |}        {col 63}        {c |}        
{txt}27    {res}{col 9}-0.0238{col 18} 0.0111{col 27} 21.621{col 36}0.7564{col 44}        {c |}        {col 63}        {c |}        
{txt}28    {res}{col 9}-0.0113{col 18}-0.0301{col 27} 21.637{col 36}0.7978{col 44}        {c |}        {col 63}        {c |}        
{txt}29    {res}{col 9} 0.0640{col 18} 0.0281{col 27} 22.157{col 36}0.8136{col 44}        {c |}        {col 63}        {c |}        
{txt}30    {res}{col 9}-0.0215{col 18} 0.0115{col 27} 22.216{col 36}0.8461{col 44}        {c |}        {col 63}        {c |}        
{txt}31    {res}{col 9}-0.0227{col 18} 0.0432{col 27} 22.284{col 36}0.8739{col 44}        {c |}        {col 63}        {c |}        
{txt}32    {res}{col 9} 0.0046{col 18} 0.0492{col 27} 22.287{col 36}0.8995{col 44}        {c |}        {col 63}        {c |}        
{txt}33    {res}{col 9} 0.0338{col 18} 0.0309{col 27} 22.445{col 36}0.9172{col 44}        {c |}        {col 63}        {c |}        
{txt}34    {res}{col 9}-0.0093{col 18} 0.0418{col 27} 22.457{col 36}0.9352{col 44}        {c |}        {col 63}        {c |}        
{txt}35    {res}{col 9}-0.0312{col 18} 0.0533{col 27} 22.598{col 36}0.9478{col 44}        {c |}        {col 63}        {c |}        
{txt}36    {res}{col 9}-0.0244{col 18}-0.0985{col 27} 22.687{col 36}0.9589{col 44}        {c |}        {col 63}        {c |}        
{txt}
{com}. //yes
. 
. varsoc logprivate logpublic logsdp

{txt}{col 4}Selection-order criteria
{col 4}Sample:  {res}1997q1 - 2015q2 {txt}{col 49}Number of obs {col 68}= {res}       74
{col 3}{text}{c TLC}{hline 4}{c TT}{hline 9}{hline 8}{hline 1}{hline 5}{hline 7}{hline 8}{hline 1}{hline 9}{hline 1}{hline 9}{hline 1}{hline 9}{hline 1}{hline 1}{c TRC}
{col 3}{text}{c |}lag{col 8}{c |}    LL  {col 18}   LR  {col 27}  df{col 32}   p  {col 39}   FPE {col 48}    AIC {col 58}   HQIC {col 68}   SBIC {col 79}{c |}
{res}{col 3}{text}{c LT}{hline 4}{c +}{hline 9}{hline 8}{hline 1}{hline 5}{hline 7}{hline 8}{hline 1}{hline 9}{hline 1}{hline 9}{hline 1}{hline 9}{hline 1}{hline 1}{c RT}
{col 3}{text}{c |}  0{col 8}{c |}{result}{space 1}-34.8823{col 18}{col 27}{col 32}{col 39} .000559{col 48}{space 1} 1.02384{col 58}{space 1} 1.06111{col 68}{space 1} 1.11725{col 79}{text}{c |}
{res}{col 3}{text}{c |}  1{col 8}{c |}{result}{space 1} 152.776{col 18}{space 1} 375.32{col 27}   9{col 32} 0.000{col 39} 4.5e-06{col 47}*{col 48}{space 1}-3.80477{col 57}*{col 58}{space 1}-3.65572{col 67}*{col 68}{space 1}-3.43113{col 77}*{col 79}{text}{c |}
{res}{col 3}{text}{c |}  2{col 8}{c |}{result}{space 1}  160.31{col 18}{space 1} 15.068{col 27}   9{col 32} 0.089{col 39} 4.7e-06{col 48}{space 1}-3.76514{col 58}{space 1}-3.50431{col 68}{space 1}-3.11128{col 79}{text}{c |}
{res}{col 3}{text}{c |}  3{col 8}{c |}{result}{space 1} 170.269{col 18}{space 1} 19.917{col 26}*{col 27}   9{col 32} 0.018{col 39} 4.6e-06{col 48}{space 1}-3.79104{col 58}{space 1}-3.41843{col 68}{space 1}-2.85696{col 79}{text}{c |}
{res}{col 3}{text}{c |}  4{col 8}{c |}{result}{space 1} 174.504{col 18}{space 1} 8.4718{col 27}   9{col 32} 0.487{col 39} 5.2e-06{col 48}{space 1}-3.66228{col 58}{space 1}-3.17788{col 68}{space 1}-2.44798{col 79}{text}{c |}
{res}{col 3}{text}{c BLC}{hline 4}{c BT}{hline 9}{hline 8}{hline 1}{hline 5}{hline 7}{hline 8}{hline 1}{hline 9}{hline 1}{hline 9}{hline 1}{hline 9}{hline 1}{hline 1}{c BRC}
{res}{txt}{space 3}Endogenous:  logprivate logpublic logsdp
{space 3} Exogenous:  _cons

{com}. 
. //johansen test for cointegration
. vecrank logprivate logpublic logsdp, trend(constant) lags(4)
{res}
{txt}{center 79:Johansen tests for cointegration}
Trend: constant{col 57}Number of obs = {res}{col 6}     74
{txt}Sample:  {res}1997q1 - 2015q2{txt}{col 66}Lags = {res}      4
{txt}{hline 79}
{col 58}5%
maximum{col 46}trace{col 55}critical
  rank{col 11}parms{col 23}LL{col 32}eigenvalue{col 44}statistic{col 57}value
{col 3}{res}  0{col 12}30  {col 19} 153.50173{col 33}       .{col 44}  42.0055{col 55}  29.68
{col 3}  1{col 12}35  {col 19} 169.60623{col 33} 0.35290{col 44}   9.7965{help vecrankstar##|_new:*}{col 55}  15.41
{col 3}  2{col 12}38  {col 19} 173.73304{col 33} 0.10554{col 44}   1.5429{col 55}   3.76
{col 3}  3{col 12}39  {col 19} 174.50448{col 33} 0.02063
{txt}{hline 79}

{com}. //rank = 1 --> I(1) series so need to do VAR
. 
. vec logprivate logpublic logsdp, trend(constant) lags(4)

{res}{txt}Vector error-correction model

{col 1}Sample:  {res}1997q1 - 2015q2 {txt}{col 49}Number of obs{col 67}= {res}        74
{txt}{col 49}AIC{col 67}=  {res}-3.638006
{txt}Log likelihood = {res} 169.6062{txt}{col 49}HQIC{col 67}=  {res}-3.203287
{txt}Det(Sigma_ml){col 16}= {res} 2.05e-06{txt}{col 49}SBIC{col 67}=  {res}-2.548246

{col 1}{text}Equation        {col 18}  Parms{col 26}     RMSE {col 37}   R-sq  {col 47}   chi2   {col 58} P>chi2
{res}{col 1}{text}{hline 17}{hline 8}{hline 11}{hline 10}{hline 11}{hline 7}
{col 1}{text}D_logprivate    {col 18}{result}    11{col 26}{space 2} .157294{col 37}{space 1} 0.1965{col 47} 15.40504{col 58} 0.1647
{col 1}{text}D_logpublic     {col 18}{result}    11{col 26}{space 2} .063794{col 37}{space 1} 0.2437{col 47} 20.29888{col 58} 0.0414
{col 1}{text}D_logsdp        {col 18}{result}    11{col 26}{space 2} .193837{col 37}{space 1} 0.4830{col 47} 58.85491{col 58} 0.0000
{col 1}{text}{hline 17}{hline 8}{hline 11}{hline 10}{hline 11}{hline 7}
{res}
{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}D_logprivate {txt}{c |}
{space 8}_ce1 {c |}
{space 9}L1. {c |}{col 14}{res}{space 2}-.1665287{col 26}{space 2} .0696244{col 37}{space 1}   -2.39{col 46}{space 3}0.017{col 54}{space 4}  -.30299{col 67}{space 3}-.0300675
{txt}{space 12} {c |}
{space 2}logprivate {c |}
{space 9}LD. {c |}{col 14}{res}{space 2} .0116768{col 26}{space 2} .1215692{col 37}{space 1}    0.10{col 46}{space 3}0.923{col 54}{space 4}-.2265945{col 67}{space 3} .2499481
{txt}{space 8}L2D. {c |}{col 14}{res}{space 2} .1127391{col 26}{space 2} .1233106{col 37}{space 1}    0.91{col 46}{space 3}0.361{col 54}{space 4}-.1289452{col 67}{space 3} .3544234
{txt}{space 8}L3D. {c |}{col 14}{res}{space 2}-.0281931{col 26}{space 2} .1219874{col 37}{space 1}   -0.23{col 46}{space 3}0.817{col 54}{space 4}-.2672841{col 67}{space 3} .2108978
{txt}{space 12} {c |}
{space 3}logpublic {c |}
{space 9}LD. {c |}{col 14}{res}{space 2}-.5924881{col 26}{space 2} .3074116{col 37}{space 1}   -1.93{col 46}{space 3}0.054{col 54}{space 4}-1.195004{col 67}{space 3} .0100275
{txt}{space 8}L2D. {c |}{col 14}{res}{space 2}-.2785331{col 26}{space 2} .3014645{col 37}{space 1}   -0.92{col 46}{space 3}0.356{col 54}{space 4}-.8693927{col 67}{space 3} .3123264
{txt}{space 8}L3D. {c |}{col 14}{res}{space 2}-.2383092{col 26}{space 2}  .299957{col 37}{space 1}   -0.79{col 46}{space 3}0.427{col 54}{space 4}-.8262141{col 67}{space 3} .3495958
{txt}{space 12} {c |}
{space 6}logsdp {c |}
{space 9}LD. {c |}{col 14}{res}{space 2}-.1196971{col 26}{space 2} .1046425{col 37}{space 1}   -1.14{col 46}{space 3}0.253{col 54}{space 4}-.3247926{col 67}{space 3} .0853983
{txt}{space 8}L2D. {c |}{col 14}{res}{space 2}-.2308295{col 26}{space 2} .1060983{col 37}{space 1}   -2.18{col 46}{space 3}0.030{col 54}{space 4}-.4387784{col 67}{space 3}-.0228805
{txt}{space 8}L3D. {c |}{col 14}{res}{space 2} -.118888{col 26}{space 2} .0970065{col 37}{space 1}   -1.23{col 46}{space 3}0.220{col 54}{space 4}-.3090173{col 67}{space 3} .0712413
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0534848{col 26}{space 2} .0209923{col 37}{space 1}    2.55{col 46}{space 3}0.011{col 54}{space 4} .0123406{col 67}{space 3} .0946289
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}D_logpublic  {txt}{c |}
{space 8}_ce1 {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .0588555{col 26}{space 2} .0282377{col 37}{space 1}    2.08{col 46}{space 3}0.037{col 54}{space 4} .0035107{col 67}{space 3} .1142004
{txt}{space 12} {c |}
{space 2}logprivate {c |}
{space 9}LD. {c |}{col 14}{res}{space 2} .0235236{col 26}{space 2}  .049305{col 37}{space 1}    0.48{col 46}{space 3}0.633{col 54}{space 4}-.0731125{col 67}{space 3} .1201598
{txt}{space 8}L2D. {c |}{col 14}{res}{space 2} .0450562{col 26}{space 2} .0500113{col 37}{space 1}    0.90{col 46}{space 3}0.368{col 54}{space 4}-.0529641{col 67}{space 3} .1430765
{txt}{space 8}L3D. {c |}{col 14}{res}{space 2}-.0363659{col 26}{space 2} .0494747{col 37}{space 1}   -0.74{col 46}{space 3}0.462{col 54}{space 4}-.1333345{col 67}{space 3} .0606026
{txt}{space 12} {c |}
{space 3}logpublic {c |}
{space 9}LD. {c |}{col 14}{res}{space 2}-.0563863{col 26}{space 2} .1246775{col 37}{space 1}   -0.45{col 46}{space 3}0.651{col 54}{space 4}-.3007496{col 67}{space 3}  .187977
{txt}{space 8}L2D. {c |}{col 14}{res}{space 2} .0657892{col 26}{space 2} .1222655{col 37}{space 1}    0.54{col 46}{space 3}0.591{col 54}{space 4}-.1738467{col 67}{space 3} .3054252
{txt}{space 8}L3D. {c |}{col 14}{res}{space 2}-.0064959{col 26}{space 2} .1216541{col 37}{space 1}   -0.05{col 46}{space 3}0.957{col 54}{space 4}-.2449335{col 67}{space 3} .2319417
{txt}{space 12} {c |}
{space 6}logsdp {c |}
{space 9}LD. {c |}{col 14}{res}{space 2} .0048593{col 26}{space 2}   .04244{col 37}{space 1}    0.11{col 46}{space 3}0.909{col 54}{space 4}-.0783216{col 67}{space 3} .0880402
{txt}{space 8}L2D. {c |}{col 14}{res}{space 2}-.0861577{col 26}{space 2} .0430305{col 37}{space 1}   -2.00{col 46}{space 3}0.045{col 54}{space 4}-.1704959{col 67}{space 3}-.0018195
{txt}{space 8}L3D. {c |}{col 14}{res}{space 2}  .022294{col 26}{space 2} .0393431{col 37}{space 1}    0.57{col 46}{space 3}0.571{col 54}{space 4}-.0548171{col 67}{space 3}  .099405
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0054567{col 26}{space 2} .0085139{col 37}{space 1}    0.64{col 46}{space 3}0.522{col 54}{space 4}-.0112302{col 67}{space 3} .0221436
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}D_logsdp     {txt}{c |}
{space 8}_ce1 {c |}
{space 9}L1. {c |}{col 14}{res}{space 2} .2961434{col 26}{space 2} .0857997{col 37}{space 1}    3.45{col 46}{space 3}0.001{col 54}{space 4}  .127979{col 67}{space 3} .4643078
{txt}{space 12} {c |}
{space 2}logprivate {c |}
{space 9}LD. {c |}{col 14}{res}{space 2}-.2510087{col 26}{space 2} .1498127{col 37}{space 1}   -1.68{col 46}{space 3}0.094{col 54}{space 4}-.5446361{col 67}{space 3} .0426187
{txt}{space 8}L2D. {c |}{col 14}{res}{space 2}-.0674312{col 26}{space 2} .1519585{col 37}{space 1}   -0.44{col 46}{space 3}0.657{col 54}{space 4}-.3652645{col 67}{space 3}  .230402
{txt}{space 8}L3D. {c |}{col 14}{res}{space 2}-.0868251{col 26}{space 2}  .150328{col 37}{space 1}   -0.58{col 46}{space 3}0.564{col 54}{space 4}-.3814626{col 67}{space 3} .2078123
{txt}{space 12} {c |}
{space 3}logpublic {c |}
{space 9}LD. {c |}{col 14}{res}{space 2} .0530314{col 26}{space 2} .3788306{col 37}{space 1}    0.14{col 46}{space 3}0.889{col 54}{space 4}-.6894629{col 67}{space 3} .7955257
{txt}{space 8}L2D. {c |}{col 14}{res}{space 2}-.0578715{col 26}{space 2} .3715018{col 37}{space 1}   -0.16{col 46}{space 3}0.876{col 54}{space 4}-.7860017{col 67}{space 3} .6702587
{txt}{space 8}L3D. {c |}{col 14}{res}{space 2} .2409963{col 26}{space 2} .3696441{col 37}{space 1}    0.65{col 46}{space 3}0.514{col 54}{space 4}-.4834928{col 67}{space 3} .9654854
{txt}{space 12} {c |}
{space 6}logsdp {c |}
{space 9}LD. {c |}{col 14}{res}{space 2}-.4725077{col 26}{space 2} .1289534{col 37}{space 1}   -3.66{col 46}{space 3}0.000{col 54}{space 4}-.7252517{col 67}{space 3}-.2197637
{txt}{space 8}L2D. {c |}{col 14}{res}{space 2}-.4109074{col 26}{space 2} .1307475{col 37}{space 1}   -3.14{col 46}{space 3}0.002{col 54}{space 4}-.6671678{col 67}{space 3} -.154647
{txt}{space 8}L3D. {c |}{col 14}{res}{space 2}-.3062451{col 26}{space 2} .1195434{col 37}{space 1}   -2.56{col 46}{space 3}0.010{col 54}{space 4}-.5405459{col 67}{space 3}-.0719443
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0289913{col 26}{space 2} .0258693{col 37}{space 1}    1.12{col 46}{space 3}0.262{col 54}{space 4}-.0217116{col 67}{space 3} .0796942
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

Cointegrating equations
{res}
{col 1}{text}Equation        {col 18}  Parms{col 26}   chi2   {col 37} P>chi2
{res}{col 1}{text}{hline 17}{hline 8}{hline 11}{hline 7}
{col 1}{text}_ce1            {col 18}{result}     2{col 26} 443.7033{col 37} 0.0000
{col 1}{text}{hline 17}{hline 8}{hline 11}{hline 7}
{res}
{txt}Identification:  beta is exactly identified

{col 18}Johansen normalization restriction imposed
{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}        beta{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}_ce1         {txt}{c |}
{space 2}logprivate {c |}{col 14}{res}{space 2}        1{col 26}{space 2}        .{col 37}{space 1}       .{col 46}{space 3}    .{col 54}{space 4}        .{col 67}{space 3}        .
{txt}{space 3}logpublic {c |}{col 14}{res}{space 2}-1.947127{col 26}{space 2} .2872632{col 37}{space 1}   -6.78{col 46}{space 3}0.000{col 54}{space 4}-2.510153{col 67}{space 3}-1.384102
{txt}{space 6}logsdp {c |}{col 14}{res}{space 2} -1.36556{col 26}{space 2} .1919545{col 37}{space 1}   -7.11{col 46}{space 3}0.000{col 54}{space 4}-1.741784{col 67}{space 3} -.989336
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 23.83989{col 26}{space 2}        .{col 37}{space 1}       .{col 46}{space 3}    .{col 54}{space 4}        .{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
. irf create var1, step(20) set(myirf) replace
{txt}(file myirf.irf now active)
(file myirf.irf updated)

{com}. irf graph oirf, impulse(logpublic logprivate) response(logprivate logpublic) yline(0,lcolor(black)) xlabel(0(4)20) byopts(yrescale)
{res}{txt}
{com}. 
. 
. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}/Users/shraddhaanand/Documents/Classes/Spring 2020/MIT 14.33/Homework/Data/State Stata files/Rajasthan Log.txt
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}11 May 2020, 13:42:31
{txt}{.-}
{smcl}
{txt}{sf}{ul off}